{"appId":"app.comaps.fdroid","appShortcutName":"CoMaps - Hike, Bike, Drive Offline with Privacy","appDisplayName":"CoMaps - Hike, Bike, Drive Offline with Privacy","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://codeberg.org/comaps/comaps/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"Easy map navigation - Discover more of your journey - Powered by the community\nA community-led free & open source maps app based on OpenStreetMap data and reinforced with commitment to transparency, privacy and being not-for-profit. CoMaps is a fork/spin-off of Organic Maps, which in turn is a fork of Maps.ME.\n\nRead on about reasons for the project and its direction at <b><i>codeberg.org/comaps</i></b>.\nJoin the community there and help make the best maps app\n• Use the app and spread the word about it\n• Give feedback and report issues\n• Update map data in the app or on the OpenStreetMap website\n\n‣ <b>Offline-focused</b>: Plan and navigate your trip abroad without the need for cellular service, search waypoints while on a distant hike, etc. All app functions are designed to work offline.\n‣ <b>Respecting Privacy</b>: The app is designed with privacy in mind - does not identify people, does not track, and does not collect personal information. Ads-free.\n‣ <b>Simple and Polished</b>: essential easy to use features that just work.\n‣ <b>Saves Your Battery and Space</b>: Doesn’t drain your battery like other navigation apps. Compact maps save precious space on your phone.\n‣ <b>Free and Built by the Community</b>: People like you helped build the app by adding places to OpenStreetMap, testing and giving feedback on features and contributing their development skills and money.\n‣ <b>Open and Transparent Decision-making and Financials, Not-for-profit and Fully Open Source.</b>\n\n<b>Main Features</b>:\n<ul>\n<li>Downloadable detailed maps with places which are not available with Google Maps</li>\n<li>Outdoor mode with highlighted hiking trails, campsites, water sources, peaks, contour lines, etc</li>\n<li>Walking paths and cycleways</li>\n<li>Points of interest like restaurants, gas stations, hotels, shops, sightseeings and many more</li>\n<li>Search by name or an address or by point of interest category</li>\n<li>Navigation with voice announcements for walking, cycling, or driving</li>\n<li>Bookmark your favorite places with a single tap</li>\n<li>Offline Wikipedia articles</li>\n<li>Subway transit layer and directions</li>\n<li>Track recording</li>\n<li>Export and import bookmarks and tracks in KML, KMZ, GPX formats</li>\n<li>A dark mode to use during the night</li>\n<li>Improve map data for everyone using a basic built-in editor</li>\n</ul>\n\n<b>Freedom Is Here</b>\nDiscover your journey, navigate the world with privacy and community at the forefront!\n","repo":{"author":"Unknown","repo":"https://codeberg.org/comaps/comaps"},"version":"8b7136149c7399629e592f72812af1e644ac2261fd7d8f2bea8991b401a0d699","site":null,"source":"https://codeberg.org/comaps/comaps","license_or_tos":"Apache-2.0","resources":null,"verified":false}