{"appId":"f:chat.delta.lite","appShortcutName":"ArcaneChat","appDisplayName":"ArcaneChat","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/chat.delta.lite_300007144.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["X64"]}},"displayImages":[],"description":"⚡ Fast encrypted chats for the family 🎉\nArcaneChat is a decentralized and secure messenger app that is compatible with the existing e-mail infrastructure.\n\nSome features at a glance:\n\n💬 Reliable instant messaging with multi-profile and multi-device support.\n\n⚡️ Sign-up easily using secure fast chatmail servers. You don’t need a phone number or any private data.\n\n📧 Alternatively, use your existing classic e-mail address to read your inbox as chats.\n\n🎮 Interactive mini-apps in chats for gaming and collaboration.\n\n🔒 Audited end-to-end encryption safe against network and server attacks.\n\nArcaneChat is a Delta Chat client and was created with a focus on usability, good user experience, and saving data plan. Also the app usually experiments with new features that eventually might get added to the official Delta Chat client.\n\n<b>Main differences with official Delta Chat client:</b>\n\n<ul>\n<li>Support for some markdown styles in text messages (bold, italic, strike, etc.)</li>\n<li>Support for displaying Telegram's animated stickers (.tgs files)</li>\n<li>Support for SVG images previews</li>\n<li>Multiple color themes/skins</li>\n<li>It is possible to disable profiles to completely disconnect them saving data/bandwidth</li>\n<li>You can easily see the connection status of all your profiles in the profile switcher</li>\n<li>A videochat instance is set by default</li>\n<li>Location streaming feature enabled by default and extra option to share location for 12 hours</li>\n<li>Clicking on a message with a POI location, will open the POI on the map</li>\n<li>Last-seen status of contacts is shown in your contact list, like in WhatsApp, Telegram, etc.</li>\n<li>Videos are played in loop, useful for short GIF videos</li>\n<li>Verified icon is shown in the chat list for the \"Device Messages\" chat</li>\n<li>Voice messages have more aggressive compression in \"worse quality\" mode to save data plan</li>\n<li>Automatic download of messages limited to 640KB by default</li>\n<li>Profile's display name is always shown in the app's title bar instead of the name of the app</li>\n<li>Your avatar is visible to other users in Mailing Lists</li>\n<li>Can be selected as app to open .xdc files</li>\n<li>For mini-apps developers: there are some extra features in the WebXDC API, check https://github.com/ArcaneChat/android/#webxdc</li>\n<li>Better settings organization with additional \"Privacy\" section</li>\n</ul>\n","repo":{"author":"Asiel Díaz Benítez","repo":"https://github.com/ArcaneChat/android"},"version":"ba4683c6d6ef0ae4a861beae944abc7c8b03918c088420d6c79c242dc0dda422","site":null,"source":"https://github.com/ArcaneChat/android","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,104,97,116,46,100,101,108,116,97,46,108,105,116,101,47,101,110,45,85,83,47,105,99,111,110,95,115,89,71,45,103,49,71,86,103,53,76,87,119,109,118,99,100,102,75,76,116,119,100,53,114,76,70,113,88,73,117,97,54,77,114,65,70,87,108,114,48,76,48,61,46,112,110,103]},"verified":false}