{"appId":"com.zell_mbc.publicartexplorer.foss","appShortcutName":"PublicArtExplorer","appDisplayName":"PublicArtExplorer","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.zell_mbc.publicartexplorer.foss_30.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Discover and view public art\nHave you ever found yourself standing before a piece of outdoor art, curious about its story?\nOr arrived in a new place wondering if there’s any outdoor artwork waiting to be discovered nearby?\n\nPublicArtExplorer allows you to discover and explore public art around you in just two clicks. The app uses your location to instantly reveal nearby sculptures, murals, and installations, complete with detailed information about each piece and its artist.\n\nPublicArtExplorer’s data is based on the open platforms OpenStreetMap and Wikipedia. Because these platforms are built and maintained by a global community of volunteers, anyone can contribute: if you notice missing details or discover new artworks, you’re encouraged to add or update information directly on OpenStreetMap or Wikipedia. This collective approach means that every contribution helps to improve the app for all users, fostering a shared, up-to-date resource that benefits everyone interested in public art.\n\n## Key features\n\nShow what's around and offer to show the details for each artwork.\n\nAimed at providing low barrier access to public art as well as instigiating people to add missing information to OSM and Wikipedia for the benefit of others.\n\n## Web site\n\nhttps://publicartexplorer.com/\n","repo":{"author":"Thomas Zell","repo":"https://gitlab.com/toz12/PublicArtExplorer"},"version":"57bd25c22a4bc68bfb1eca0cba88c04f43816f2a08c1529b662ac2ced37683e5","site":null,"source":"https://gitlab.com/toz12/PublicArtExplorer","license_or_tos":"AGPL-3.0-only","resources":null,"verified":false}