{"appId":"com.kazumaproject.markdownhelperkeyboard","appShortcutName":"Sumire Japanese Keyboard","appDisplayName":"Sumire Japanese Keyboard","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.kazumaproject.markdownhelperkeyboard_586.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Sumire is a privacy-first offline Japanese keyboard for simple, fast typing\nSumire is a fully offline Japanese keyboard (IME) for Android. Even without an internet connection, you can type in Japanese; all input, learning data, and your user dictionary are processed and stored on your device. Nothing is ever sent to external servers, so you can use it with confidence if you value privacy and security. Whether you are underground, in airplane mode, roaming overseas, or in areas with weak signal, Sumire delivers uninterrupted Japanese typing.\n\n■ Concept\n“Your words stay on your device.” Sumire is a privacy-first Japanese input app with no ads and no tracking. It’s lightweight, low-latency, and ready for everything from daily chats to business email and long-form writing.\n\n■ Key Features\n・Fully offline: Works with zero data usage. Type anywhere without signal and keep battery impact to a minimum.\n・Privacy by design: On-device storage and processing only. No external transmission—ideal for sensitive information.\n・Fast input engine: Low-latency taps and flicks. Candidate suggestions appear quickly, so even long text feels smooth.\n・Optimized predictions: Covers common words, everyday phrases, and work terms to reduce taps and speed up input.\n・Flick and QWERTY layouts: Choose one-handed flick input or a QWERTY keyboard for romaji and physical-keyboard use.\n・Simple, intuitive UI: Clear settings and easy switching. Friendly for first-time users.\n・Black & White modern theme: High-contrast, minimal design that stays readable in dark or light environments.\n・Lightweight build: Quick launch and switching, smooth even on low-spec devices.\n・Free and ad-free: No payments or subscriptions—clean experience that lasts.\n\n■ Feature Details\n・Prediction and learning: Offers suitable conversion candidates based on your input trends. Learning is on-device only, improving efficiency while protecting privacy.\n・Flick input optimization: Move naturally from the center of the vowel key to each direction for fast “a/i/u/…” entry—great for one-handed thumb typing.\n・QWERTY for Japanese: Smooth romaji input for everything from short messages to documents.\n・Refined conversion: Comfortable punctuation, symbols, and numbers. Context-aware candidates help keep your writing flow.\n・User dictionary: Register frequently used terms and proper nouns to boost efficiency—stored on device for peace of mind.\n・Stability and reliability: With no ads or tracking scripts, there’s no extra overhead—just a consistently fast, stable typing experience.\n\n■ Recommended For\n・Typing Japanese offline on subways, flights, and overseas trips\n・Business users handling confidential data such as customer info or internal documents\n・One-handed flick typers who want fast chats and social posts\n・Students and professionals who prefer efficient romaji input on a QWERTY keyboard\n・Anyone seeking a safe, ad-free Japanese keyboard for Android\n\n■ Example Use Cases\n・Replying to messages or taking notes during commutes (works smoothly even with unstable signal)\n・Secure note-taking in meetings or on the go (no network required)\n・Writing journals or drafts in airplane mode or in remote areas (fully offline)\n・Privacy-sensitive conversations (all processing stays on device)\n\n■ Why You Can Trust It\nSumire is built on the core requirements of a Japanese keyboard—fast input, accurate prediction, lightweight performance, and easy one-hand use—while putting privacy first. With no external transmission, it fits strict security environments and scales from personal use to work use. It offers the essentials you expect from an IME with a minimal UI that lets you start right away without confusion.\n\nFully offline, privacy-first, fast flick input, lightweight, and ad-free. Sumire delivers a comfortable, safe Japanese typing experience for everyone on Android. Install now and enter your words “safely, swiftly, and beautifully.”\n","repo":{"author":"Kazuma Naka","repo":"https://github.com/KazumaProject/JapaneseKeyboard"},"usrVersion":"78fcda55eb3e5dbbae8fb38dcc60a00c71a5ffc486e4bceb828082d7ebf54260","version":1762850959,"site":null,"source":"https://github.com/KazumaProject/JapaneseKeyboard","license_or_tos":"MIT","resources":null,"verified":false}