{"appId":"com.bitmavrick.lumolight","appShortcutName":"Lumolight: Screen & Flashlight","appDisplayName":"Lumolight: Screen & Flashlight","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.bitmavrick.lumolight_23.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Simple, modern & easy-to-use flashlight app that comes with a ton of features.\nLumolight is an open-source flashlight app that can perform both front and back flash. The app is designed based on the \"Material You\" design system and it looks stunning. The app supports both light and dark themes and supports dynamic theming.\n\nIt uses the screen as a front flash by brightening up and showing some static colors that the user chooses and it uses the flashlight for the torch mode. It has \"Tile support\" where you can use the front flash without even opening the app, and also adjust the brightness using the volume keys\n\nThe customization option is one of the strong parts of this app. For the front flash, you can choose: \n\nColors: Which color do you want to light up\nDuration: For how long it will be active.\nBrightness: The level of brightness you want.\n\nFor the back flash:\nDuration: For how long it will be active.\nBPM (Blink per minute): You can blink your flashlight and also adjust its value.\nFlash-strength: You can also adjust the flashlight's strength. (Supported devices only)\n\nWe are constantly improving our app by adding exciting features and fixing any issues that arise. With this app, you can be sure it will bring a good user experience.","repo":{"author":"Unknown","repo":"https://github.com/BitMavrick/Lumolight"},"version":"0df61f7ed40e754e904ad0cd361404eb20beb3a8a60fec6c0e47536bf5205724","site":null,"source":"https://github.com/BitMavrick/Lumolight","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}