{"appId":"f:com.github.catfriend1.syncthingandroid","appShortcutName":"Syncthing-Fork","appDisplayName":"Syncthing-Fork","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.github.catfriend1.syncthingandroid_1290200.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","X86","X64"]}},"displayImages":[],"description":"Wrapper for Syncthing - Open and decentralized file synchronization\nThis is a fork of the Syncthing-Android wrapper for Syncthing that brings major enhancements like:\n* Folder, device and overall sync progress can easily be read off the UI.\n* \"Syncthing Camera\" - an optional feature (with optional permission to use the camera) where you can take pictures with your friend, partner, ... on two phones into one shared and private Syncthing folder. No cloud involved. - FEATURE CURRENTLY IN BETA STAGE -\n* \"Sync every hour\" to save even more battery\n* Individual sync conditions can be applied per device and per folder\n* Recent changes UI, click to open files.\n* Changes to folder and device config can be made regardless if Syncthing is running or not\n* UI explains why syncthing is running or not.\n* \"Battery eater\" problem is fixed.\n* Discover other Syncthing devices on the same network and easily add them.\n* Supports two-way synchronization on external SD card since Android 11.\n\nSyncthing-Fork for Android is a wrapper for Syncthing that provides an Android UI instead of Syncthing's built-in Web UI. Syncthing replaces proprietary sync and cloud services with something open, trustworthy and decentralized. Your data is your data alone and you deserve to choose where it is stored, if it is shared with some third party and how it's transmitted over the Internet.\n\nGoals of the fork:\n* Develop and try out enhancements together with the community.\n* Release the wrapper more frequently to identify and fix bugs caused by changes in the syncthing submodule\n* Make enhancements configurable in the UI, users should be able to turn them on and off\n\nComparison between upstream and fork at the time of writing this:\n* Both contain the syncthing binary built from the official source at GitHub\n* Syncing functionality and reliability depends on the syncthing binary submodule version.\n* Fork gets along with upstream and sometimes they pick up my improvements.\n* Strategy and release frequency is different\n* Only the wrapper containing the Android UI is addressed by the fork.\n\nWebsite: https://github.com/Catfriend1/syncthing-android\n\nSource code: https://github.com/Catfriend1/syncthing-android\n\nHow Syncthing writes to external SD card: https://github.com/Catfriend1/syncthing-android/blob/master/wiki/SD-card-write-access.md\n\nWiki, FAQ and helpful articles: https://github.com/Catfriend1/syncthing-android/wiki\n\nIssues: https://github.com/Catfriend1/syncthing-android/issues\n\nPlease help with the\nTranslation: https://hosted.weblate.org/projects/syncthing/android/catfriend1\n","repo":{"author":"Unknown","repo":"https://github.com/Catfriend1/syncthing-android-fdroid"},"version":"169e15efadee7cf620fd4a4afec4a607a72a12db50c458f858a7b94f34cb6043","site":null,"source":"https://github.com/Catfriend1/syncthing-android-fdroid","license_or_tos":"MPL-2.0","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,103,105,116,104,117,98,46,99,97,116,102,114,105,101,110,100,49,46,115,121,110,99,116,104,105,110,103,97,110,100,114,111,105,100,47,101,110,45,85,83,47,105,99,111,110,95,101,103,87,79,119,84,87,90,112,81,95,49,67,120,109,100,114,119,80,53,119,82,116,97,53,69,86,109,67,67,117,122,81,87,120,106,73,53,74,84,115,48,119,61,46,112,110,103]},"verified":false}