{"appId":"com.huntercoles.pokerpayout","appShortcutName":"Poker Payout","appDisplayName":"Poker Payout","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.huntercoles.pokerpayout_23.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Professional poker tournament management with payouts and timers\nPoker Payout Calculator is your complete tournament management solution for poker games. Whether running home games or casino tournaments, this professional app handles everything with a beautiful poker-themed interface.\n\nKey Features:\n\n• Payout Calculator: Configure tournament structure and calculate payouts with customizable weight distributions for fair prize pools\n\n• Bank Tracker: Track player payments with checkboxes for buy-ins, food pools, and bounty payments. Real-time payment status and pool summaries keep everything organized\n\n• Professional Blind Timer: Tournament-grade timer with countdown/countup modes and visual progress indicators. Dynamic blind structure engine automatically scales blinds based on your tournament parameters\n\n• Tournament Tools: Complete management toolkit including chip distribution calculator, ICM calculations, and payout weight customization\n\n• Privacy First: All data stored locally with no internet connection required\n\n• Authentic Design: Poker green color scheme and clean interface optimized for tournament play\n\nPerfect for home games, casino tournaments, and poker enthusiasts who want professional-grade tournament management in a free, open-source app.","repo":{"author":"Hunter Coles, Joshua Glenn","repo":"https://github.com/HunterColes/PokerPayout"},"usrVersion":"74789170092d03a86877b1774337bdb600f8f54d3435138a84648e2733e95339","version":1765392901,"site":null,"source":"https://github.com/HunterColes/PokerPayout","license_or_tos":"MIT","resources":null,"verified":false}