{"appId":"com.github.umer0586.sensagram","appShortcutName":"Sensa Gram","appDisplayName":"Sensa Gram","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.github.umer0586.sensagram_10.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Stream Android sensor data over UDP with minimal latency.\nTransform your Android device into a dynamic sensor hub with Sensagram, offering seamless real-time data streaming. Sensagram allows you to seamlessly stream live sensor data over UDP, ensuring low latency\n\nEffortlessly broadcast a wide range of Android sensors, including motion, position, environmental, and GPS (location) data, directly to a specified IP address or server, making it the perfect tool for developers, researchers, and tech enthusiasts.\n\nKey Features:\n\n- Real-time Streaming: Transmit sensor data in real time for accurate and immediate feedback.\n- Comprehensive Sensor Support: Stream data from motion (gyroscope, accelerometer), position (magnetic field, rotation vector), environmental (light, temperature), and GPS (location) sensors.\n- Low Latency with UDP: Experience the speed and efficiency of UDP, providing minimal delay in data transmission, ideal for time-sensitive applications.\n- Customizable Endpoints: Easily configure and send data to your desired IP address or network endpoint.\n\nIn the app, select the desired sensors from the list and tap the \"Stream\" button. This will begin transmitting sensor data to the specified address. To receive the data, you'll need to set up a UDP server. The app sends the data in JSON format.\n\nFor complete guidance please visit https://www.github.com/UmerCodez/SensaGram\n","repo":{"author":"Umer Farooq","repo":"https://github.com/umer0586/SensaGram"},"usrVersion":"6d164f10f5f9c9f1eced9f15e5351f5ce931810ab82a8527fe769051709de9cc","version":1765453241,"site":null,"source":"https://github.com/umer0586/SensaGram","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}