{"appId":"com.southerntemp.thermocouples","appShortcutName":"Thermocouples","appDisplayName":"Thermocouples","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.southerntemp.thermocouples_17.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Reference and calculations for thermocouples\nThermocouples is a reference guide to get general information on thermocouples for all those in the industry that regularly deal with thermal sensors.\nThis handy app features the colour codes for a wide range of thermocouples in a wide range of standards on easy to see images. The shown standards are IEC, BS, ANSI, NFE, DIN, and JIS.\nThe included thermocouples are B, E, J, K, N, R, S, T, U, Vx.\n\nMain features:\n* Shows thermocouples colours for 10 thermocouples across 6 standards.\n* Information on range, conductor materials and compensates.\n* Search thermocouples by conductor colours to find type and colour code.\n* Temperature converter with 째C, 째F and K.\n* Cold junction 째C to mV calculator.\n* Modern design.\n* Open-source via the MIT licence.\n* mV to 째C converter using NIST values for main thermocouple types.\n\nThermocouples is open source. The source can be found at:\nhttps://codeberg.org/danb/Thermocouples\nFeel free to create a pull request or open issues there.\n\nThis app is 100% free with no \"upgrade\", \"pro\" or \"unlocked\" versions.\nThis app requires no permissions and does not use any user data.\n\nRemarks:\nThis application is for quick reference use only, there may be errors or inaccuracies although I try to ensure the information is as accurate as possible. Me, the app maker, or the company advertised, STS, will not be held liable for any misinformation or misjudgement as a result of using this app.","repo":{"author":"Dan Brown","repo":"https://codeberg.org/danb/Thermocouples"},"usrVersion":"3a4d4213f1d529d65e376e250d5670d793e5902821014574116599070030b962","version":1766993148,"site":null,"source":"https://codeberg.org/danb/Thermocouples","license_or_tos":"MIT","resources":null,"verified":false}