{"appId":"com.aisleron","appShortcutName":"Aisleron Shopping List","appDisplayName":"Aisleron Shopping List","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.aisleron_7.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Aisleron: Fly through the shops!\nStreamline your shopping with this intuitive, easy-to-use shopping list app. Whether you’re preparing for a weekly grocery run or shopping for a special occasion, this app helps you stay organized and efficient.\n\nKey Features:\n* Create Custom Shops & Aisles: Add your favorite stores, categorize items by aisles, and easily organize your shopping list based on your local layout.\n* Smart Product Management: Add products to your list and assign them to the appropriate area in your home. Rearrange products by aisle within each store to match your shopping route.\n* Swipe-to-Track: Keep track of your shopping progress with a simple swipe. Swipe left or right to mark items as “Needed” or “In Stock.”\n* Show on Lock Screen: No need to unlock your screen at the end of each aisle. Your shopping list will be displayed over the lock screen for convenience.\n* Easy Editing: Long-press any item to edit or delete it\n\nWhy you’ll love it:\n* Stay organized by shopping smarter.\n* Reduce time spent navigating the store.\n* Never forget an item again — track everything you need with ease.\n* Light and Dark themes.\n* Free, no ads.\n* Everything is done on the local device, no sharing of location data or shopping habits.\n\nGet started today and make your shopping trips faster and more efficient!","repo":{"author":"aisleron.com","repo":"https://github.com/aisleron/aisleron"},"version":"ce900f474f668f598a2b55e91759b46cf47acd163c596fb89d8810c0fcb974eb","site":null,"source":"https://github.com/aisleron/aisleron","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}