{"appId":"com.inspiredandroid.kai","appShortcutName":"Kai","appDisplayName":"Kai","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.inspiredandroid.kai_47.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Powerful Conversational AI\nKai is a cross-platform open-source AI interface that connects you to powerful conversational AI models. Through a simple and intuitive chat interface, you can engage with models from Gemini, xAI, Groq, Mistral, and self-hosted Ollama. Whether you need help brainstorming, summarizing, writing, learning, or just want to have an engaging conversation, Kai provides a versatile platform.\n\nSupported AI Services\n• Ollama - Connect to your self-hosted local AI models\n• Gemini - Google's powerful AI with file attachment support\n• xAI - Access Grok models\n• Groq - Ultra-fast AI inference\n• Mistral AI - Free tier available\n\nKey Features\n• Encrypted Local Storage: Your chat history is securely stored with encryption on your device\n• Text to Speech: Listen to AI responses with built-in text-to-speech output\n• File Attachments: Attach files to your conversations (Gemini)\n• Seamless Service Switching: Easily switch between different AI providers\n• Multi-Turn Conversations: Natural flowing conversations where the AI remembers context\n• Simple Chat Interface: Intuitive design for both technical and non-technical users\n\nAI Tools (can be enabled in settings)\n• Get Local Time - AI can access current date and time\n• Get Location - Location-aware responses based on IP\n• Send Notification - Receive push notifications from AI\n• Create Calendar Event - Create events directly from chat\n• Check Recent SMS - View your SMS conversations\n• Send SMS - Reply to SMS through the AI\n\nPrivacy Note: Kai stores your chat history locally with encryption. When using cloud-based AI services, your inputs are sent to the respective providers for processing. No data is collected by the app itself.","repo":{"author":"Simon Schubert","repo":"https://github.com/SimonSchubert/Kai"},"usrVersion":"5e14708c084b9ea7c70255305ad66c5f4791ba8dad0dc3036e9d5069ac5bf7e1","version":1771523425,"site":null,"source":"https://github.com/SimonSchubert/Kai","license_or_tos":"Apache-2.0","resources":null,"verified":false}