{"appId":"f:com.flx_apps.digitaldetox","appShortcutName":"DetoxDroid: Digital Detoxing as Your New Default","appDisplayName":"DetoxDroid: Digital Detoxing as Your New Default","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.flx_apps.digitaldetox_20006.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Get rid of attention-grabbing and manipulative features.\nUsually, \"Digital Detoxing\" apps in Android are about opting-in for a contract to not use our phones for the next X minutes. Or that we will not use the app Y for more than Z minutes. These contracts are often reinforced with financial incentives, i.e. if we fail we will have to pay a fee of a few dollars to the developers.\n\nThis app follows a different approach by stripping away all the attention-grabbing and manipulative features of other apps. DetoxDroid does not require you to choose a time and place when you want to \"detox\", or punish you if you fail. Instead, it aims to enable you to use your phone rather than letting your phone use you.\n\nFEATURES\n* Grayscale: Going grayscale removes positive reinforcements and dampens compulsive smartphone use.\n* Exceptions: Exclude apps like your camera or gallery from the grayscale feature.\n* Automatic Do Not Disturb: Never forget to enter the \"Do Not Disturb\" mode.\n* Opt-out > Opt-in: Deliberately pause DetoxDroid rather than deliberately switching it on.\n\nINSTALLATION\nUnfortunately, installing the app on your phone is not enough for the grayscale feature to work. If your phone is rooted, you can grant the necessary permissions from the app. Otherwise, you need to grant the WRITE_SECURE_SETTINGS permission from your computer.\nDon't worry though, this usually will not take you more than a few minutes. Find out how to do it on GitHub: https://github.com/flxapps/DetoxDroid#installation\n\nSUPPORT DETOXDROID\nIf you like the project, please consider becoming a patron on LiberaPay or buying me a coffee via Ko-Fi/PayPal. I would love to invest more time into it.\nFurthermore, always feel free to write me a mail or discuss the app on GitHub.","repo":{"author":"flxapps","repo":"https://github.com/flxapps/DetoxDroid"},"version":"9e91d08abfe05dada610a953e4084814c39189e52a568fe9b55c5afe158bba74","site":null,"source":"https://github.com/flxapps/DetoxDroid","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,102,108,120,95,97,112,112,115,46,100,105,103,105,116,97,108,100,101,116,111,120,47,101,110,45,85,83,47,105,99,111,110,95,83,56,105,107,90,51,110,102,103,71,97,117,101,82,121,80,106,119,51,57,113,70,71,67,86,82,76,110,114,57,110,115,114,73,67,99,50,55,121,120,70,103,99,61,46,112,110,103]},"verified":false}