{"appId":"com.inspiredandroid.kai","appShortcutName":"Kai","appDisplayName":"Kai","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.inspiredandroid.kai_33.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Powerful Conversational AI\nKai is designed to provide you with access to powerful, state-of-the-art conversational AI models. Through a simple and intuitive chat interface, you can engage with models like Llama and Google's Gemini, exploring their capabilities for various tasks. Whether you need help brainstorming, summarizing, writing, learning, or just want to have an engaging conversation, Chat AI provides a versatile platform.\n\nImportant Note: This application requires an internet connection, as all requests are processed on a remote server. Please be aware that using these cloud-based models involves sending your inputs to a remote server. This may have some privacy considerations, so be mindful of the information you provide to the AI. While the app itself does not store chat history, and user inputs are sent to the models for processing, no data or user IDs are stored by the application.\n\nKey Features\nCloud-Based AI: Access powerful conversational AI models hosted on a remote server. You can explore a variety of cutting-edge models, continually updated and improved.\nChoice of AI Models: Select your preferred model (e.g., Llama or Gemini) based on your needs and preferences. This feature allows you to experiment with various AI capabilities and performance.\nMulti-Turn Conversations: Engage in natural and flowing, multi-turn conversations. This means the AI can remember previous turns in the conversation, enabling more complex and nuanced interactions.\nVersatile Assistance: Utilize the AI for various tasks such as writing, brainstorming, summarizing, learning, and more. You can use Chat AI for anything from quick questions to in-depth explorations.\nSimple Chat Interface: Easily interact with the AI through an intuitive and straightforward chat interface, designed for ease of use for any user.\nAccessible to All: Designed to be easy to use for both technical and non-technical users alike. You don't need prior experience with AI to benefit from Chat AI.","repo":{"author":"Simon Schubert","repo":"https://github.com/SimonSchubert/Kai"},"usrVersion":"5fe6f0f76b4aa4d766c754fdf15066d7070757941b0b3ffe0f669106506e7742","version":1768052888,"site":null,"source":"https://github.com/SimonSchubert/Kai","license_or_tos":"Apache-2.0","resources":null,"verified":false}