{"appId":"f:com.nltechno.dolidroidpro","appShortcutName":"DoliDroid","appDisplayName":"DoliDroid","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.nltechno.dolidroidpro_63.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Use Dolibarr ERP & CRM\nUse Dolibarr ERP & CRM (https://www.dolibarr.org/) from your device.\n\nThis application is not a standalone program. It is a front end client to use\nyour online hosted instance of Dolibarr ERP & CRM software (Open-source web\nsoftware to manage your business). The advantages of DoliDroid are:\n\n* DoliDroid is not a duplicated code of Dolibarr for Android, but rewamps your Dolibarr web installation, so all your online existing features are supported by this application. This is also true for external modules features.\n* Upgrading Dolibarr will not break DoliDroid.\n* DoliDroid use embedded image resources of your version, when available, to reduce bandwidth usage.\n* DoliDroid use internal cache for pages that should not change during session (like menu page)\n* Connections parameters (login/password) are saved. No need to enter them each time you use DoliDroid.\n* Integration with your phone or other applications is better (Clicking on a PDF opens the PDF reader, clicking onto email or phone launch your email application or launch Android dialer, ...)\n* A lot of other enhancement make usability of your Dolibarr from a smartphone better like:\n* Save spaces of the menus bars by replacing the menu with a button always visible to choose your meny entry more friendly.\n* Provide a button, always available, to make a quick search on any item.\n* All visible dates use year on 2 chars instead of 4 to save you space.\n* When the popup calendar is opened, the keyword is no more opened if not required, like it is on a common browser (Dolibarr v7 required).\n* Components that provide help information on mouse hover are hidden to save space (they are useless without a mouse).\n* A lot of other not useful information are hidden.","repo":{"author":"Unknown","repo":"https://github.com/DoliCloud/dolidroid"},"version":"8b10d0b6a37137af324ee2b40cf74429f2c31a7bc43cf3f60057d23fb80f35e3","site":null,"source":"https://github.com/DoliCloud/dolidroid","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}