{"appId":"com.grappim.hateitorrateit.fdroid","appShortcutName":"Hate It Or Rate It","appDisplayName":"Hate It Or Rate It","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/grappim/https://github.com/Grigoriym/HateItOrRateIt/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Track and decide: Love it or leave it with every purchase.\nIntroducing \"Hate it or Rate it,\" the innovative app designed to transform your shopping experience by allowing you to keep track of products you love and those you'd rather avoid. Whether you're exploring new items or revisiting past purchases, \"Hate it or Rate it\" provides a simple yet powerful platform to manage your shopping decisions effectively.\n\nKey Features:\n\nProduct Tracking: Easily upload photos, names, descriptions, and store information of your favorite and not-so-favorite products.\nInformed Decisions: Make smarter purchase decisions based on your own historical ratings and experiences.\nEasy Organization: Sort your products into 'Hate' or 'Rate' categories for quick reference and decision-making.\nPrivacy First: With optional Google Analytics and Firebase Crashlytics integration, you're in control of your data. Opt in or out anytime for a personalized app experience.\nWhether you're a meticulous shopper who loves to keep detailed records of every purchase or someone looking for a fun way to track the hits and misses in your shopping adventures, \"Hate it or Rate it\" is your go-to companion.\n\nJoin the \"Hate it or Rate it\" community today and start making informed decisions that save you time and money, all while enjoying a tailored shopping journey!","repo":{"author":"grappim","repo":"https://github.com/Grigoriym/HateItOrRateIt"},"version":"e419398a3a5bfaf031da6baca1cdddf2d1714b96f4664b639f975bbca1432424","site":null,"source":"https://github.com/Grigoriym/HateItOrRateIt","license_or_tos":"Apache-2.0","resources":null,"verified":false}