{"appId":"com.yahyaoui.prayermode","appShortcutName":"Prayer mode","appDisplayName":"Prayer mode","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.yahyaoui.prayermode_6.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Automatic DND for prayer times without being disturbed during your Salah.\nAre you tired of remembering to put your smartphone on silent mode before every prayer? Have you ever forgotten \nto activate silent mode, then your humility diminishes when notifications or a call interrupt your prayer? And perhaps you might disturb the worshippers next to you?\n\nWith the precisely designed Prayer mode app, no more worry or embarrassment. Our app activates Do Not Disturb mode \non your behalf, allowing you to focus deeply in prayer and avoid distracting those praying around you.\n\nSet it once, the app does the rest! It works automatically in the background, keeping you informed via notifications.\n\nCustomize Your Prayer Settings:\n•\tCalculation Methods: Access 23 Prayer Calculation Methods powered by aladhan.com API.\n•\tThe Five Daily Prayers: Adjust silent duration for all prayers.\n•\tFriday Prayer: Set silent periods before and after Adhan.\n•\tRamadan Nights: Customizable durations for Taraweeh and Tahajjud.\n•\tEid Prayers: Customizable time and silent duration for Eid al-Fitr and Eid al-Adha.\n•\tSmart Location Detection: Automatically adjusts prayer times based on your precise location and reschedule DND mode for the next prayers.\n\nIn addition to automatic Do Not Disturb mode and smart location adaptation, receive important and timely notifications:\n•\tAlerts for Do Not Disturb activation and deactivation at each prayer.\n•\tNotification of time adjustments when travelling.\n•\tReminder for Fajr time, Dhuhr on Friday, and the start of Imsak during Ramadan.\n\nOur app is designed with a comfortable and user-friendly interface, also featuring Light and Dark modes for \ncomfortable viewing. You can also use the Prayer mode Quick Settings Tile for faster access to the app. \nYour privacy is our utmost priority; we are committed to protecting your data and do not collect any personal \ninformation, ensuring a safe and trustworthy experience.\n\nOur app is designed to serve the Muslim Ummah and supports multiple languages including Arabic, English, French, \nUrdu, Indonesian, Malaysian, Turkish, as well as languages that will be added later.\n\nWe are working hard to provide the best experience with our app, so expect more functionalities in upcoming \nfree updates.\n\nDownload the app today, and make your prayer surrounded by devotion and tranquillity.\n","repo":{"author":"Yahyaoui Mohamed Brahim","repo":"https://github.com/prayermode/prayermode"},"usrVersion":"be64fc7dee2f59d353c6454fb173031e59540d89a8a4e4fb59bb4ff679baad4e","version":1765912741,"site":null,"source":"https://github.com/prayermode/prayermode","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}