{"appId":"com.guruswarupa.launch","appShortcutName":"Launch - Minimalist Launcher","appDisplayName":"Launch - Minimalist Launcher","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.guruswarupa.launch_1.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A clean, efficient, and minimalist Android launcher.\nLaunch – A Clean, Minimalist Android Launcher Focused on Simplicity and Productivity\n\nLaunch is a lightweight, efficient Android launcher that blends minimalism with powerful smart features to help you stay focused, organized, and in control of your device. Designed for users who value speed, clarity, and privacy, Launch makes managing your phone easier than ever before.\n\n✨ Key Features\n🔍 Smart App Management\nAutomatically sorts apps by usage frequency\n\nRarely used apps grouped and ordered alphabetically\n\nApp usage statistics shown beside each app icon\n\nWeekly phone usage summary displayed on the home screen\n\nLong press to uninstall apps instantly\n\nEasily toggle between grid and list layouts\n\n🔎 Smart Universal Search\nSearch apps, contacts, and even the web—all in one bar\n\nBuilt-in calculator for instant calculations as you type\n\nTap-to-call, message, or WhatsApp from contact results\n\nQuick access links to Play Store, YouTube, Maps, and more\n\n⚡ Quick Actions & Widgets\nTime Widget: Tap to open the Clock app\n\nDate Widget: Tap to open the Calendar\n\nSearch Bar:\n\nLong press → Open Google in browser\n\nDouble tap → Change wallpaper\n\nInstant math calculation built-in\n\nWeather Widget: Real-time weather and forecast with support for OpenWeatherMap API key\n\n🧩 Customizable Dock\nAdd favorite apps and organize them in groups\n\nRename or remove dock apps with a long press\n\nCustomize the layout and number of dock apps\n\n🔕 Focus Mode\nStay productive and distraction-free:\n\nLong press Focus icon to configure allowed apps\n\nTemporarily hide selected apps during focus time\n\nCountdown timer to lock you in until the session ends\n\nVisual timer displayed on screen\n\n📝 Quick Notes Widget\nAdd, view, and edit notes directly from the home screen\n\nLong press to delete or modify notes\n\nAll notes are stored locally for privacy and speed\n\n💰 Built-in Finance Tracker\nA minimal, offline-first tool to manage your income and expenses:\n\nTrack earnings and spending with custom descriptions\n\nView net savings for the current month\n\nLong press the Balance to see your transaction history\n\nLightweight and doesn't require internet access\n\n⚙️ Customization & Settings\nImport/export launcher data for easy backup and restore\n\nReset app usage stats anytime\n\nToggle between list/grid layouts\n\nUpdate your personal weather API key easily\n\n🤏 Gestures & Interactions\nGesture\tAction\nTap Time Widget\tOpen Clock\nTap Date Widget\tOpen Calendar\nLong Press Search Bar\tOpen Google in browser\nDouble Tap Search Bar\tChange wallpaper\nLong Press App Icon\tUninstall the app\nLong Press Dock App\tRename or remove app\nType Math in Search\tInstantly calculate\nLong Press Focus Icon\tConfigure Focus Mode\nLong Press Balance\tView financial history\n\n🎙️ Voice Commands\nControl your device hands-free via search bar voice input:\n\nExample Command\tAction\n\"Call Swaroop\"\tInitiates a phone call\n\"Message Swaroop\"\tOpens the SMS app\n\"WhatsApp Swaroop\"\tLaunches WhatsApp conversation\n\"Send hi to Swaroop\"\tSends a WhatsApp message\n\"Search weather tomorrow\"\tPerforms a Google search\n\"Open YouTube\"\tLaunches YouTube\n\"Uninstall WhatsApp\"\tOpens uninstall prompt\n\"Bangalore to Mysore\"\tOpens Google Maps with directions\n\nRequired Permissions: Contacts, Phone, SMS (used only for the features you invoke)\n\n🔐 Privacy First\nLaunch is privacy-respecting and offline-friendly. It only requests essential permissions for functionality:\n\nContacts: for app and contact search\n\nPhone/SMS: to make calls or send messages when requested\n\nStorage: to save notes, wallpaper, and backup data\n\nNo background tracking. No ads. No analytics.\n\nLightweight. Powerful. Intentional. Try Launch – and take back control of your home screen.\n","repo":{"author":"Guru Swarupa","repo":"https://github.com/guruswarupa/launch"},"version":"34506da8c5085d512482490cb9251b1dd63e56c15c72bdc5485372698ea2cec8","site":null,"source":"https://github.com/guruswarupa/launch","license_or_tos":"MIT","resources":null,"verified":false}