{"appId":"com.yahyaoui.prayermode","appShortcutName":"Prayer mode","appDisplayName":"Prayer mode","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.yahyaoui.prayermode_7.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Automatic Do Not Disturb for Islamic prayer times - Your Salah first.\nAre you tired of remembering to silence your phone before every prayer? Have you ever been interrupted by notifications during Salah or worried about disturbing others?\n\nPrayer Mode solves this by automatically activating Do Not Disturb mode at precise prayer times, allowing you to focus completely on worship without distractions.\n\n🎯 Set It Once, It Works Automatically:\n• Smart Automation: Activates DND mode at exact prayer times\n• 23 Calculation Methods: Choose from established prayer time calculations (aladhan.com API)\n• Location-Aware: Automatically adjusts when you travel\n• Complete Customization: Individual settings for every prayer scenario\n\n🕌 Prayer-Specific Features:\n• Five Daily Prayers: Custom silent durations for Fajr, Dhuhr, Asr, Maghrib, Isha\n• Friday Prayer: Silent periods before and after Adhan\n• Ramadan Nights: Settings for Taraweeh and Tahajjud\n• Eid Prayers: Custom timing for Eid al-Fitr and Eid al-Adha\n• Audio Takbir: Optional sound notification before silence\n• Ablution Time: DND 10 minutes before Adhan for preparation\n\n🔔 Stay Informed:\n• Notifications for DND activation/deactivation\n• Prayer time updates when travelling\n• Reminders for Fajr, Friday Dhuhr, and Ramadan Imsak\n\n✨ User Experience:\n• Clean interface with Light/Dark themes\n• Quick Settings Tile for instant access\n• Multi-language support (Arabic, English, French, Urdu, Indonesian, Malaysian, Turkish, Bengali, Spanish + more coming)\n• Privacy First: No data collection - all processing happens on your device\n\n🌍 Serving the Muslim Ummah:\nWe're committed to providing a respectful, accurate tool for prayer focus. Expect regular free updates with new features and improvements.\n\nDownload Prayer Mode today and experience uninterrupted, focused prayer.\n","repo":{"author":"Yahyaoui Mohamed Brahim","repo":"https://github.com/prayermode/prayermode"},"usrVersion":"d59299bc74ef527d1ab8483a7a51e347c06103b4fe748d2b5d8f4605824b386a","version":1771333316,"site":null,"source":"https://github.com/prayermode/prayermode","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}