{"appId":"com.jksalcedo.passvault","appShortcutName":"PassVault","appDisplayName":"PassVault","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.jksalcedo.passvault_21.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A secure, lightweight, and 100% offline password manager.\nPassVault is a secure, lightweight, and 100% offline password manager for Android.\n\nPassVault is a lightweight password manager that allows users to securely store credentials on their device. All data is stored locally and sensitive information is encrypted using the Android Keystore system. The application does not require internet permissions. User data never leaves the device.\n\nFEATURES:\n\n- Secure Authentication: Access your vault using a PIN or Biometric (fingerprint) login.\n- Encrypted Storage: All passwords are encrypted at rest using AES-256 and stored securely in a local Room database.\n- 100% Offline-First: The app is fully functional without an internet connection.\n- Password Generation: Create strong, random passwords directly within the app.\n- Password Strength Scoring: Visual feedback on password security.\n- Backups: Import or Export encrypted/unencrypted data\n- Automatic Backups: Automatically backup your database with configurable retention and copies per backup.\n- Custom Backup Location: Choose where to save your backups using Storage Access Framework.\n- Third-Party Import: Seamlessly import existing vault from Bitwarden and KeePass.\n- Supports JSON, CSV, and KDBX files.\n- Custom Categories: Create and manage your own entry categories.\n- Filter/Search Entries\n- Block Screenshots: Prevent screen capture for enhanced security.\n","repo":{"author":"Jaressen Kyle Salcedo","repo":"https://github.com/jksalcedo/PassVault"},"usrVersion":"afcaf98b14ad183f635f5fb1c468f6ac0868bcabb7e8175690fe8842f13eda78","version":1767471709,"site":null,"source":"https://github.com/jksalcedo/PassVault","license_or_tos":"MIT","resources":null,"verified":false}