{"appId":"com.giacomomensio.ricevapp","appShortcutName":"Ricevapp Documento Commerciale","appDisplayName":"Ricevapp Documento Commerciale","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.giacomomensio.ricevapp_14.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Third-party app for quick access, not affiliated with Agenzia delle Entrate\nTired of the Hassle? Meet Ricevapp Documento Commerciale.\n\nAre you a craftsman, merchant, or professional who needs to issue a \"Documento Commerciale Online\"? You know that the official service doesn't have its own app and that logging in through a browser every time can be cumbersome.\n\nThat's exactly why I developed Ricevapp Documento Commerciale. I created it primarily for myself: I needed a quick, cost-free solution for accessing the service and issuing tax receipts.\n\nYour Free Solution for Tax Receipts\nRicevapp is a third-party web-app that solves a practical problem: your need for instant access, every time, without paying for subscriptions:\n\n• Maximum Access Speed: The app gets you to the online commercial document procedure as efficiently as possible, saving you valuable time. If you wish, you can save your Fisconline/Entratel credentials exclusively locally on your device to speed up the entire login process.\n\n• Protected and Compatible Access: To ensure privacy, app access is protected at every launch. It uses the unlock method set on your device (such as fingerprint, face recognition, PIN, or pattern). This prevents unauthorized access to your saved data. Note: The unlock method is only requested if you have set one up in your device's security settings.\n\n• Free Forever: Forget the costs of a cash register or subscription-based software services. This app is and will always remain completely free.\n\n• Designed by a Worker for Workers: Developed by a craftsman who understands the need for simple, effective, and, above all, free tax tools.\n\n⚠️ Important: Mandatory Disclaimer\nRicevapp Documento Commerciale is a third-party application and is in no way affiliated with or supported by the \"Agenzia delle Entrate\" (Italian Revenue Agency). The app solely provides facilitated access to the publicly available \"Documento Commerciale Online\" service.\n\nDownload Ricevapp now and make accessing your online tax service faster and more secure!","repo":{"author":"Unknown","repo":"https://github.com/giacomomensio/RicevappDocumentoCommerciale"},"usrVersion":"1677e3647370cdf6114f72b78120ce1fcd70c8e165448a94d91198dfd1c8f260","version":1768109087,"site":null,"source":"https://github.com/giacomomensio/RicevappDocumentoCommerciale","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}