{"appId":"com.helddertierwelt.mentalmath","appShortcutName":"Mental Math","appDisplayName":"Mental Math","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.helddertierwelt.mentalmath_13.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Practice mental arithmetic solo or compete with friends.\n\"Mental Math\" is a simple and clean Android app for mental arithmetic training. You can practice on your own or challenge friends to compete and improve your skills. The app is open source and respects your privacy.\n\nCustomizable Training\nSelect which arithmetic operations to include (+, −, ×, ÷). For each operation, choose from nine difficulty levels to customize your training precisely to your skill level.\n\nTwo Game Modes\n• Task Mode lets you complete a fixed number of tasks (10, 20, 30, 40, or 50).\n• Timed Mode challenges you to solve as many tasks as possible within a time limit (1, 2, 3, 4, or 5 minutes).\n\nChallenge your Friends\nYou can share a game link to:\n1. Replay a completed game with the exact same tasks to compare scores with friends.\n2. Start a new game with preset settings for a fair and fresh challenge for everyone.\n\nDifficulty Calculation\nTask difficulty is determined using algorithms based on column addition, column subtraction, long multiplication, and long division, creating realistic and well-balanced exercises.\n\nDetailed Results\nAfter each game, view a detailed summary that includes your selected settings, your performance (accuracy, speed, and score), and a complete list of all your tasks and answers for review.\n\nPersonal Leaderboard\nYour top 10 results are displayed separately for each combination of settings, allowing you to easily track your progress. You can also review detailed summaries of your top games at any time.\n\nGame History\nExplore the complete history of all your scored games. You can sort the list by time or numerically to find specific games. Anytime, you can revisit any match to view a detailed summary of its results.\n\nClean Design\nA simple and minimalist app design with no unnecessary elements or distractions, designed to keep your focus fully on mental math training. Supports both light and dark modes.\n\nOpen Source and Privacy\n\"Mental Math\" is fully open source, free to use, and does not collect or process any personal data. It requires no permissions, contains no ads, and runs entirely offline to respect your privacy.","repo":{"author":"HeldDerTierwelt","repo":"https://codeberg.org/Mental-Math/MentalMath"},"usrVersion":"54276b099ccf4ccb22ac68fa8a1009134572a4eab46d627a6af5ce4b96951681","version":1764328644,"site":null,"source":"https://codeberg.org/Mental-Math/MentalMath","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}