{"appId":"f:com.duckduckgo.mobile.android","appShortcutName":"DuckDuckGo Privacy Browser","appDisplayName":"DuckDuckGo Privacy Browser","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.duckduckgo.mobile.android_52250000.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Privacy, simplified\nAt DuckDuckGo, we believe the Internet shouldn't feel so creepy, and getting the\nprivacy you deserve online should be as simple as closing the blinds.\n\nOur app provides the privacy essentials you need to seamlessly take control of\nyour personal information as you search and browse the web, no matter where the\nInternet takes you:\n\n* Escape Advertising Tracker Networks — Our Privacy Protection will block all the hidden third-party trackers we can find, exposing the major advertising networks tracking you over time, so that you can track who's trying to track you.\n* Increase Encryption Protection — We force sites to use an encrypted connection where available, protecting your data from prying eyes, like ISPs.\n* Search Privately — You share your most personal information with your search engine, like your financial, medical, and political questions. What you search for is your own business, which is why DuckDuckGo search doesn't track you. Ever.\n* Decode Privacy Policies — We've partnered with Terms of Service Didn't Read to include their scores and labels of website terms of service and privacy policies, where available.\n\nAs you search and browse, the DuckDuckGo Privacy Browser shows you a Privacy\nGrade rating when you visit a website (A-F). This rating lets you see how\nprotected you are at a glance, dig into the details to see who we caught trying\nto track you, and learn how we enhanced the underlying site's privacy measures.\nThe Privacy Grade is scored automatically based on the prevalence of hidden\ntracker networks, encryption availability, and website privacy practices.\n\nOur app provides standard browsing functionality including tabs, bookmarks, and\nautocomplete. In addition to strong Privacy Protection as described above, we\nalso packed in some extra privacy features into the browser itself:\n\n* Fire Button — Clear all your tabs and data with one tap.\n* Application Lock — Secure the app with Touch ID or Face ID.\n\nToo many people believe you simply can't expect privacy on the Internet. We're\nfighting to change that, and have made it our mission to set a new standard of\ntrust online. Install DuckDuckGo and take back your privacy!\n\nAntifeatures:\n* NonFreeNet - Uses DuckDuckGo as the exclusive search engine, for which the\nsource code is not available.","repo":{"author":"DuckDuckGo","repo":"https://github.com/duckduckgo/Android"},"version":"6ce8887014a139e1af7e1a043b8421975b6b9b7b00de7dada5a2d59fb62b8ca8","site":null,"source":"https://github.com/duckduckgo/Android","license_or_tos":"Apache-2.0","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,100,117,99,107,100,117,99,107,103,111,46,109,111,98,105,108,101,46,97,110,100,114,111,105,100,47,101,110,45,85,83,47,105,99,111,110,95,81,121,75,104,110,106,95,67,48,80,101,107,51,120,116,74,65,102,80,70,84,118,121,119,82,88,68,117,116,115,86,104,55,114,45,57,116,45,100,111,80,57,69,61,46,112,110,103]},"verified":false}