{"appId":"com.github.catfriend1.syncthinglite","appShortcutName":"Syncthing-Lite","appDisplayName":"Syncthing-Lite","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.github.catfriend1.syncthinglite_2000001.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Browse Syncthing shares\n⚡ Revival of the app which was abandoned years ago.\n\n✅ Safety warning: Please always ensure that you have backed up your data by other means and that this backup is up to date before using this app. The app is still in early development.\n\n⚠️ We assume no liability for data corruption or loss, although we make every effort to deliver quality.\n\nThis is an Android app which you can use as a client to access Syncthing shares offered by remote devices. It works similar to file sharing apps  accessing their server. \n\nThis is a client-oriented implementation, designed to work online by downloading and uploading files from an active device on the network instead of synchronizing a local copy of the entire folder. Due to that, you will see a sync progress of 0% at other devices which is expected. This is useful for devices where you don't want to download the entire contents of a shared folder. For example, mobile devices with limited storage available where you like to access a syncthing shared folder. This is quite different from the way the Syncthing-Fork app works.\n\nPlease note that for technical reasons you can't reconnect via relay connection for some minutes after the app was closed. This may happen due to removing from the recent apps list, force close or an interrupted connection to remote device. This constraint does not apply for connections directly established through the local network.\n\nSource code: https://github.com/researchxxl/syncthing-lite\n","repo":{"author":"Unknown","repo":"https://github.com/researchxxl/syncthing-lite"},"usrVersion":"751b99407724c9e1ff0aaaf893135959167e1ef49241d0a4ae24763e3fb2c0d7","version":1767944746,"site":null,"source":"https://github.com/researchxxl/syncthing-lite","license_or_tos":"MPL-2.0","resources":null,"verified":false}