{"appId":"f:com.tasomaniac.openwith.floss","appShortcutName":"Open Link With...","appDisplayName":"Open Link With...","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.tasomaniac.openwith.floss_21000.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":22,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Open links in native apps when you're stuck in the browser! 🚀\nShare the current web page when you are in a browser to open with another app!\n\nDid it ever happen to you? You click a link (let's say a video link) and the system does not ask you anything and opens the link in the browser. And you are stuck in a web page instead of watching the video in the native app.\n\nThere are 2 options for you. You either watch the video in the web or you remember the name of the video and search it in the app. Well, not anymore.\n\nWith OpenLinkWith, you can share any webpage with it and it will ask you which applications to open the link with.\n\nAlthough the original intent of the application is to direct web pages to apps, it can even be used to switch between apps. Imagine you have 2 Twitter clients in your phone. You can open a tweet in the official Twitter application and then switch to an another app with the same tweet opened. Cool, hah?\n\nAlthough the problem discovered above is not huge, it is missing in the Android ecosystem. And I couldn't find anything doing this. So I wrote one. :)\n\nIf you find yourself sharing the same url over and over, you can use \"Add to Home Screen\" feature to add your favorite link from your favorite app to your home screen.\n\nI hope you find this useful. Please help me by trying it and sending feedback to me.\n\n<strong>Note:</strong This app also fixes links for some of the most popular Android applications. Not all but most of the links from these websites will be open with respective native android apps when you share them with Open Link With.\n\nThe app uses internet to: \n- Send crash reports\n- Resolve redirects of shortened links\n- Find the title of the link while using \"Add to Home Screen\"\n\nThe application is open source and the source can be found here:\nhttps://github.com/tasomaniac/OpenLinkWith/\n\nIcon is from:\nhttps://www.iconfinder.com/icons/216215/flow_switch_icon#size=512\n","repo":{"author":"Unknown","repo":"https://github.com/tasomaniac/OpenLinkWith"},"version":"a147ac3a675da1ec0db59393517a973908171bbb8a8eab69e5f5f7ebab04006e","site":null,"source":"https://github.com/tasomaniac/OpenLinkWith","license_or_tos":"Apache-2.0","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}