{"appId":"com.thirumalai.calllimiter","appShortcutName":"Call Limiter","appDisplayName":"Call Limiter","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.thirumalai.calllimiter_5.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Limit call duration per contact and automatically hang up when time is up\n<b>Call Limiter</b> is a simple, open-source Android app that helps you take control of your phone calls. Set time limits for specific contacts and let the app automatically hang up when the limit is reached — making it easy to save time, avoid distractions, and manage conversations better.\n\n<b>Features:</b>\n\n<ul>\n    <li><b>Per-Contact Call Limits:</b> Define custom call durations for individual numbers.</li>\n    <li><b>Automatic Hang-Up:</b> Calls are disconnected when the chosen time is reached.</li>\n    <li><b>Easy Time Selection:</b> Choose limits using a bottom sheet scroll wheel for a smooth experience.</li>\n    <li><b>Global Call Limit:</b> Set default time limit for all contacts.</li>\n    <li><b>Persistent Storage:</b> Your limits remain saved until you decide to change or delete them.</li>\n    <li><b>Flexible Editing:</b> Update or remove call limits anytime with ease.</li>\n    <li><b>Emergency Buffer:</b> Add a few extra seconds for urgent or unexpected needs.</li>\n    <li><b>Modern Theming:</b> Supports both light and dark modes, adapting to your system theme.</li>\n    <li><b>Privacy-Focused:</b> Works entirely offline — no internet, no tracking, no data sharing.</li>\n</ul>\n\nStay in control of your conversations with <b>Call Limiter</b> — lightweight, private, and designed to fit seamlessly into your daily calling habits.","repo":{"author":"Thirumalai K G","repo":"https://github.com/Thiru-Malai/CallLimiter"},"usrVersion":"a6bd894cb333a9b71ef9ac11176fb6a6045c03c207fea1ff6eb3551fb7c1c675","version":1764817663,"site":null,"source":"https://github.com/Thiru-Malai/CallLimiter","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}