{"appId":"com.rastislavkish.vscan","appShortcutName":"VScan","appDisplayName":"VScan","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.rastislavkish.vscan_23.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A visual perception layer for the blind\n<p>\nThis is a little project of mine aiming to research how vision LLMs could help out blind people on travel and in their every-day life by substituting eyesight for various visual tasks. VScan turns your smartphone's camera into a device for visual perception. You can define various optical cognitive functions, like looking for objects, signs, evaluating a scene or simply mediating visual impressions. You can afterwards use these functions on the camera view, just like a sighted person would use their eyes to achieve a specific goal in the physical world.\n</p>\n<p>\nEach cognitive tool consists of two major parts:\n<ul>\n<li>The camera to be used - front / back, as well as camera parameters - resolution, flashlight etc.</li>\n<li>The prompts used for LLM processing. LLM is the bridge between raw pixel data and your interpretation of it, and in the user/system prompt, you can specify what exactly are you interested in for the particular function and how should it be communicated, as well as the LLM model that should be used.</li>\n</ul>\nCamera input in combination with an LLM processing prompt forms a  cognitive function, which can be used to serve various visual tasks.\n</p>\n<p>\nVScan is open-source software. Visit the project's <a href=\"https://github.com/RastislavKish/VScan\">official repository</a> to learn more about its background, motivation, specific usage examples and setup instructions.\n</p>\n","repo":{"author":"Rastislav Kish","repo":"https://github.com/RastislavKish/VScan"},"usrVersion":"0564dabbf3aae9df6a00cd0ca2e3517339f504b81998d84a1400c16379205354","version":1766085622,"site":null,"source":"https://github.com/RastislavKish/VScan","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}