{"appId":"com.akslabs.circletosearch","appShortcutName":"CircleToSearch App","appDisplayName":"CircleToSearch App","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.akslabs.circletosearch_2.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":29,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"CircleToSearch with multi search engine support for all android\n🎯 What is Circle To Search?\nEver wanted to search for something you see on your phone screen? Circle To Search brings that power to your fingertips on any Android device. Simply draw a circle around what you're looking for, and instantly get results from your favorite search engine.\n\nThink of it as having Google Lens, Bing Visual Search, Yandex, and TinEye all in one place—and it works everywhere.\n\n✨ Features\n•Universal Compatibility: Works on any Android device (Android 10+).\n•Instant Search: Double-tap the status bar or use the floating bubble to trigger.\n•Multi-Engine Support: Search using Google Lens, Bing, Yandex, TinEye.\n•Set As Default Assistant: Use As Default Assistant to Search Images Using Circle To Search.\n•It Can Talk With Humour: Show Friendly Playful Message Every Time User Uses Circle To Search.\n•Desktop Mode: See Results In Desktop Mode.\n•Dark Mode: Browse Search Results in Dark Mode.\n•Copy Url: Copy Url Of Search Results.\n•Open In Browser: Open Search Results In Favourite Browser.\n•Smart Selection: Draw a circle, scribble to select.\n•Beautiful UI: Modern Material 3 design with dark mode support and smooth animations.\n•Customizable: Toggle dark mode, desktop mode, and UI elements like the gradient border.\n","repo":{"author":"AKS Labs","repo":"https://github.com/AKS-Labs/CircleToSearch"},"usrVersion":"ebf7f28b703d9079752def5de88f58634ba954e739ca504d73cc27ec6fe2c2c9","version":1766818508,"site":null,"source":"https://github.com/AKS-Labs/CircleToSearch","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}