{"appId":"f:com.paranoid.privacylock","appShortcutName":"Paranoid's Pal - Privacy Lock","appDisplayName":"Paranoid's Pal - Privacy Lock","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.paranoid.privacylock_7.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Unlock Privacy, Secure Your World\n These days, maintaining privacy on our devices has become increasingly challenging. With so much of our personal information stored on our phones, it’s essential to ensure it stays protected, whether from accidental access or malicious intent. Imagine situations where someone unlocks your phone while you're unaware or a scammer forces access. These scenarios are all too real in today's world.\n\nThat’s why I developed <i>Paranoid's Pal - Privacy Lock</i> It’s designed to offer an extra layer of security on top of Android’s built-in features. Here’s what makes Paranoid's Pal stand out:\n\n    * Instant Lock with Shake: In urgent situations, just shake your phone, and it locks immediately, ensuring quick protection when you need it.\n    * Automatic Screen Lock: Your phone locks automatically once the screen turns off, ensuring it's secure even when you're not actively using it.\n\n<b>Features:</b>\n\n* <i>Quick Tile Settings</i>. Quick Settings are tiles displayed in the Quick Settings panel, representing actions, that users can tap to quickly complete instant lock. \n* <i>Shortcuts</i>. Helps your quickly start common or recommended tasks within your app.\n* <i>Modern UI</i>. Enjoy a visually appealing and modern interface, following the principles of the Material You design.\n* <i>Works offline and respects your privacy</i>. Paranoid's Pal operates independently without needing an internet connection or online account registration. Your confidential data always remains on your device. Neither the developers nor any third parties can access your information. \n* <i>Adopted for Android 12</i> SplashScreen, Edge to Edge, Predictive Back navigation, enhancing modern Android UI experience. ","repo":{"author":"Concerned App","repo":"https://github.com/hardalgorithm/ParanoidsPal-PrivacyLock"},"version":"2e97dcf0145a6bb8ff824b55f23000e7b1072eebb6af08f458d2e14755f39c04","site":null,"source":"https://github.com/hardalgorithm/ParanoidsPal-PrivacyLock","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,112,97,114,97,110,111,105,100,46,112,114,105,118,97,99,121,108,111,99,107,47,101,110,45,85,83,47,105,99,111,110,95,48,104,120,106,85,97,73,103,108,88,78,119,89,115,90,50,99,116,73,99,84,98,56,69,111,45,51,69,50,116,81,69,99,81,97,55,45,70,50,110,75,78,119,61,46,112,110,103]},"verified":false}