{"appId":"com.github.khanshoaib3.nerdsteam","appShortcutName":"NerdSteam","appDisplayName":"NerdSteam","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/com.github.khanshoaib3.nerdsteam_1000005.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":30,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Discover trending games, player and price statistics, and detailed from Steam\nNerdSteam is a hobby project of mine where users can view trending and top games of Steam,\ncompare prices across platforms, view historical pricing, track player statistics, and more.\nThe app is built using Kotlin + Jetpack Compose following MVVM architecture with a clean and responsive UI.\n\nFeatures:\n- View currently trending games, top games (based on the player count) and also top records (all time most played game by player count).\n- View the game details in a structured and responsive UI.\n- See player statistics i.e., how many players on average played the game at a specific month.\n- Compare prices and deals for a game from other platforms (like GOG, Humble Store).\n- Set price alerts and bookmark games for quick access.\n- Data is sourced from multiple sources such as Steam, SteamCharts, and IsThereAnyDeal, while also caching data locally for performance.\n\n\nDesclaimer:\nThe project is not affiliated to Steam, SteamCharts, IsThereAnyDeal, or any other services that are used.\nIt's merely a wrapper of all of the mentioned websites and is not meant to replace them.\n\nSource Code: https://github.com/khanshoaib3/nerd-steam/","repo":{"author":"Mohammad Shoaib Khan","repo":"https://github.com/khanshoaib3/nerd-steam"},"usrVersion":"3c843e5a77bc70f25070c43c14fce5498360b85aa2ff37b810090a996b994cb6","version":1767380051,"site":null,"source":"https://github.com/khanshoaib3/nerd-steam","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}