{"appId":"com.example.mempal","appShortcutName":"Mempal","appDisplayName":"Mempal","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/æon/https://github.com/aeonBTC/Mempal/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A Bitcoin mempool monitoring and notification app for Android.\nMempal is a Bitcoin network monitoring app that allows users to effortlessly track key network metrics, including block height, fee rates, hashrate, and mempool size & depth. Mempal is an essential tool for users who want to optimize their transactions and track fee rates.\n<br>\n<b>Key Features</b>\n<br>\n<b>Detailed Mempool Insights:</b> Mempal provides in-depth information about the current state of the Bitcoin network, including current block height, hashrate, mempool size, fee rates, and fee distribution. This allows users to gauge network congestion and make informed decisions regarding transaction fees.\n<br>\n<b>Real-Time Notifications:</b> Users can tailor their notification settings to receive alerts when transaction fees drop below a specified threshold, when a specific TXID is confirmed, or when new blocks are mined.\n<br>\n<b>Custom Servers:</b> Connect Mempal to a self-hosted mempool server so you don't have to rely on trusted third parties to obtain information about the Bitcoin network.\n<br>\n<b>Tor Integration:</b> Enable Tor to preserve your privacy and connect to .onion mempool servers.\n<br>\n<b>Widgets:</b> Receive quick and up-to-date information about fee rates, block sizes, and mempool sizes.","repo":{"author":"æon","repo":"https://github.com/aeonBTC/Mempal"},"version":"8e05bcaa092629af4f9d9029a19eb7789c2268c2ca476d7bf04d755ac23c97ec","site":null,"source":"https://github.com/aeonBTC/Mempal","license_or_tos":"MIT","resources":null,"verified":false}