{"appId":"f:com.slavabarkov.tidy","appShortcutName":"TIDY Text-to-Image Discovery","appDisplayName":"TIDY Text-to-Image Discovery","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.slavabarkov.tidy_2.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Offline semantic Text-to-Image and Image-to-Image search on Android\nOffline Text-to-Image and Image-to-Image search on Android.\nSearch for images in your Gallery by text description and other visually similar images. TIDY works entirely offline, ensuring your privacy and security.\n\nFeatures:\n\n* Text-to-Image Search - Simply type in a description of the image you are looking for, and TIDY will retrieve the most relevant matches from your local image library. Text-to-Image search functionality in TIDY goes beyond traditional keyword-based searches! You can use longer and more detailed descriptions to find the exact image you have in mind.\n* Image-to-Image Search - Search for visually similar images by choosing a photo from your device's gallery. TIDY will analyze the image and retrieve images with similar visual features, allowing you to explore and discover new images in a whole new way.\n\nFirst launch:\nDuring the first launch TIDY will need to scan through your photo library and create an index of your images. This indexing process may take some time, but it's a one-time event. Once this initial indexing process is complete, the app will store the index on your device, and any new photos you add to your photo library will be automatically added to the index on the subsequent app launches.\n","repo":{"author":"Viacheslav Barkov","repo":"https://github.com/slavabarkov/tidy"},"version":"0d6178e8d85ffdb7e534b85bd207aa07754351744d090c6b61aa7419035c52a2","site":null,"source":"https://github.com/slavabarkov/tidy","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,115,108,97,118,97,98,97,114,107,111,118,46,116,105,100,121,47,101,110,45,85,83,47,105,99,111,110,95,90,89,55,89,108,51,66,65,69,68,80,53,50,87,100,49,76,106,89,113,120,100,116,67,79,71,81,66,108,68,110,99,118,110,116,100,83,54,79,48,54,97,111,61,46,112,110,103]},"verified":false}