{"appId":"f:com.cointrend","appShortcutName":"CoinTrend: Private Crypto Tracker","appDisplayName":"CoinTrend: Private Crypto Tracker","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.cointrend_10302.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Lightweight, fast and private cryptocurrencies monitor\nLightweight, fast and private cryptocurrencies monitor. No ads, no subscriptions, just coins.\n\n<b>Features</b>\n• Market: real-time updates of the Trending Coins (the most searched coins in the last 24h) and the Top Coins (the top 250 cryptocurrencies by market cap).\n• Favourites: track your favourite coins at a glance by adding them to the favourite list and sorting them as you wish.\n• Search: search over 10.000 coins by name or symbol.\n• Settings: choose the tracking configuration you need.\n\n<b>10.000+ real-time cryptocurrencies</b>\nCoinTrend is powered by the public CoinGecko API (https://www.coingecko.com/en/api) to track over 10.000 cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), Bitcoin Cash (BCH), Ethereum Classic (ETC), Binance Coin (BNB), Crypto.com Cronos (CRO), Cardano (ADA), Solana (SOL), Monero (XRM) and many more!\n\n<b>Clear and detailed market data</b>\nPrice, Percentage Gain, Trend Chart, MarketCap, Trading Volume 24h, Highest Price 24h, Lowest Price 24h, Available Supply, Total Supply, All-Time High Price (ATH), All-Time Low Price (ATL).\n\n<b>Lightweight</b>\nCoinTrend stores coins' data locally and updates them automatically only when needed, thus minimising mobile data usage and battery consumption. You can still manually trigger a data update whenever you need it by simply swiping down on each screen!\n\n<b>100% free and open-source</b>\nDon't trust, verify! CoinTrend is 100% free and it does not include any ads nor trackers. Its code is publicly available at https://github.com/CoinTrend. Check it out yourself and don't hesitate to reach out if you have any suggestions!\n\n<b>Designed for Android</b>\nThe User Interface has been designed following the latest Google's Material Design guidelines and using only native Android components and animations.","repo":{"author":"CoinTrend","repo":"https://github.com/CoinTrend/CoinTrend"},"version":"9bc02cd0721477397e251c7117ad03e7cb8dad60392868bf9927fbb44308ece1","site":null,"source":"https://github.com/CoinTrend/CoinTrend","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,99,111,105,110,116,114,101,110,100,47,101,110,45,85,83,47,105,99,111,110,95,68,76,76,87,122,97,87,119,75,99,52,83,86,65,71,88,102,86,103,109,89,97,110,105,98,85,113,74,97,121,122,73,65,73,108,69,115,120,65,85,88,89,99,61,46,112,110,103]},"verified":false}