{"appId":"f:com.mrsep.musicrecognizer","appShortcutName":"Audile","appDisplayName":"Audile","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.mrsep.musicrecognizer_28.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Music recognition app\n<b>Audile</b> is a music recognition application, that can help you quickly and accurately recognize a music track playing nearby you.\nThe app uses AudD and ACRCloud services to perform song identification and Odesli service to retrieve additional platform-specific track links.\n\n<b>Features:</b>\n\n<b>Recognition</b> - Audile allows you to perform song recognition in one click. The app will save the recording if there is no internet, and the recognition process will be executed when you come back online. You can customize the default behavior for unsuccessful recognition (no internet, no matches, another failure) via the preferences.\n<b>Background Usage</b> - Use the application seamlessly from the notification drawer, home screen widget, or quick settings tile. Manage the recognition process and obtain track information without launching the app.\n<b>About track</b> - In case of successful recognition, information about the track, such as the name, artist, album and year, artwork, links to this track on popular music services, lyrics is provided.\n<b>Library</b> - All recognized tracks are stored in the application's library. You can filter the track list, create a favorites collection, search for tracks, or delete tracks.\n<b>Preferences</b> - The app has a number of options for customizing its behavior and appearance, which can be found on the settings screen.\n","repo":{"author":"Aleksey Saenko","repo":"https://github.com/aleksey-saenko/MusicRecognizer"},"version":"dc0a94915f3a757eb55459182af3a57ccc96bdd968c263912c992a88a0e3b6c0","site":null,"source":"https://github.com/aleksey-saenko/MusicRecognizer","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,99,111,109,46,109,114,115,101,112,46,109,117,115,105,99,114,101,99,111,103,110,105,122,101,114,47,101,110,45,85,83,47,105,99,111,110,95,45,121,57,45,73,74,86,83,75,116,120,66,69,105,114,45,51,67,89,71,83,111,55,83,68,74,79,54,79,116,74,90,81,48,97,122,79,120,68,50,105,68,56,61,46,112,110,103]},"verified":false}