{"appId":"f:com.standardnotes","appShortcutName":"Standard Notes","appDisplayName":"Standard Notes","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/com.standardnotes_3003132.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"An end-to-end encrypted note-taking app for digitalists and professionals\nStandard Notes is a secure and private notes app. It syncs your notes securely across all your devices, including your Android devices, Windows, iOS, Linux, and Web.\n\nPrivate means your notes are end-to-end encrypted, so only you can read your notes. Even we can't read the contents of your notes.\n\nSimple means it does one job and does it well. Standard Notes is a safe and lasting place for your life's work. Our focus is making it easy to write notes wherever you are and syncing them with encryption to all your devices.\n\nOur users love us for:\n* Personal Notes\n* Tasks & Todos\n* Passwords & Keys\n* Code & Technical Procedures\n* Private Journal\n* Meeting Notes\n* Cross-platform Scratchpad\n* Books, Recipes, & Movies\n* Health & Fitness Log\n\nStandard Notes comes free with:\n* Seamless sync across all your devices, with easy to use applications on Android, Windows, Linux, iPhone, iPad, Mac, and web browsers.\n* Offline access, so you can access your downloaded notes even without a connection.\n* No limit on number of devices.\n* No limit on number of notes.\n* Passcode lock protection, along with fingerprint protection.\n* A tagging system to organize your notes (like #work, #ideas, #passwords, #crypto).\n* The ability to pin, lock, protect, and move notes to trash, which allows you to recover deleted notes until the trash is emptied.\n\nStandard Notes is completely open-source, which means when we say your notes are encrypted with industry-leading XChaCha-20 encryption, and that only you can read your notes, you don't have to take our word for it. Our code is open to the world to audit.\n\nWe made Standard Notes simple because longevity is important to us. We want to make sure we're here, protecting your notes, for the next hundred years. You shouldn't have to find a new notes app every year.\n\nTo sustain our development, we offer an optional paid program called Standard Notes Extended. Extended gives you access to powerful tools including:\n* Productivity editors (like Markdown, Code, Spreadsheets)\n* Beautiful themes (like Midnight, Focus, Solarized Dark)\n* Powerful cloud tools including daily backups of your encrypted data delivered to your email inbox every day, or backed up to your cloud provider (like Dropbox and Google Drive).\n\nYou can learn more about Extended at standardnotes.com/extended.\n\nWe're always happy to talk, whether it be a question, thought, or issue. Please feel free to email us any time at help@standardnotes.com. When you take the time to send us a message, we'll be sure to do the same.","repo":{"author":"Standard Notes Ltd.","repo":"https://github.com/standardnotes/app"},"version":"83d5878df44cc266823f3bac95955b5af4149d860e74a84ee9c55bc3df21d587","site":null,"source":"https://github.com/standardnotes/app","license_or_tos":"AGPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}