{"appId":"f:de.democracydeutschland.app","appShortcutName":"DEMOCRACY","appDisplayName":"DEMOCRACY","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/de.democracydeutschland.app_103578.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Armv7","X86"]}},"displayImages":[],"description":"Dein virtuelles Bundestagsmandat\n<b>DEMOCRACY+ ist da!</b>\n\n<b>WAHL-O-METER</b>\nDu wolltest schon immer wissen, ob die Partei, die Du gewählt hast, auch während der Legislaturperiode noch auf Deiner politischen Linie liegt und wie stark Du mit dem Abstimmungsverhalten Deines Direktkandidaten übereinstimmst, dem Du Dein Vertrauen zugesprochen hast? Der Wahl-O-Meter macht's möglich, denn mit diesem Release enthält die App endlich auch den systematischen Vergleich des eigenen Abstimmungsverhaltens mit dem der Fraktionen bzw. dem jeweiligen Direktkandidaten.\n\n<b>WAHLKREISERGEBNISSE & ABGEORDNETENPROFILE</b>\nUm den bürgerlobbyistischen Einfluss auf die Politik zu erhöhen, schlüsseln wir ab sofort das Community-Ergebnis zusätzlich nach Wahlkreisen auf. Hast du zuvor Deine Postleitzahl eingegeben, siehst Du ab sofort eine weitere Grafik, die Dich über das Abstimmungsergebnis der User in Deinem Wahlkreis informiert. Auf diese Weise möchten wir den Druck auf die Direktkandidaten erhöhen, sich regelmäßig mit den Meinungen ihrer Wähler zu beschäftigen und ihnen Rede und Antwort zu stehen. Dafür stehen in den Abgeordnetenprofilen In-App-Kontaktmöglichkeiten zur Verfügung.\n\n<b>NEUE INTERAKTIONEN</b>\nHast Du zu einem Vorgang Deine Stimme abgegeben, bieten wir Dir mit DEMOCRACY+ jetzt schnelle weitere Interaktionsmöglichkeiten an: Du kannst ab sofort mit einem Klick die Benachrichtigungen aktivieren und/oder das Gesetz teilen. Für Anträge in Vorbereitung haben wir diese Logik um das Upvoten erweitert.\n\nAber jetzt, sieh selbst, was DEMOCRACY+ für Dich bereithält!","repo":{"author":"Unknown","repo":"https://github.com/demokratie-live/democracy-client"},"version":"0c62693a75194f61f272a17cf3a092af92dbcd2b18b63573cb4530ff7ed4a326","site":null,"source":"https://github.com/demokratie-live/democracy-client","license_or_tos":"Apache-2.0","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}