{"appId":"de.schliweb.makeacopy","appShortcutName":"MakeACopy","appDisplayName":"MakeACopy","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/de.schliweb.makeacopy_107054.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":29,"abi":["X64"]}},"displayImages":[],"description":"Privacy-focused document scanner with OCR and PDF export\nMakeACopy is an open-source document scanner app for Android that allows you to digitize paper documents with offline OCR functionality. The app is privacy-friendly and works completely offline — no cloud connection, no tracking.\n\nFeatures:\n• Camera scanning: Capture documents using your device’s camera\n• Edge detection: Automatic document boundary detection using OpenCV\n• Perspective correction: Manually or automatically adjust document perspective\n• Grayscale export: Optional grayscale filter applied during PDF creation\n• OCR: Offline text recognition using the open-source Tesseract engine\n• PDF export: Save scanned documents as searchable PDFs\n• Share & save: Export locally or share via other apps\n• Dark mode: System-based Material 3 theme with light and dark appearance\n• Privacy-focused: Fully offline — no data leaves your device\n\nMakeACopy is F-Droid compliant and builds OpenCV native libraries from source during the build process, ensuring that no prebuilt binaries are included in the repository. All components are open source and respect your privacy.\n\nMakeACopy is free and open source. If you find it useful, please consider supporting development: https://ko-fi.com/egdels\n\nLicense: Apache License 2.0\n","repo":{"author":"egdels","repo":"https://github.com/egdels/makeacopy"},"usrVersion":"c99475a2f4c94cace0d5009844313e0a109d9e1a6c049acee3edc1884965922d","version":1761075496,"site":null,"source":"https://github.com/egdels/makeacopy","license_or_tos":"Apache-2.0","resources":null,"verified":false}