{"appId":"de.seemoo.at_tracking_detection","appShortcutName":"AirGuard - AirTag protection","appDisplayName":"AirGuard - AirTag protection","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Niklas Bittner/https://github.com/seemoo-lab/AirGuard/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Protect yourself from Apple's Find My Tracking\nWith AirGuard you get the anti-tracking protection you deserve! \nThe app periodically scans your surroundings for potential tracking devices, like AirTags or other Find My devices. \n\nThe AirTags and other Find My devices are simple, small and perfect to track Android users! \nWithout tracking warnings, as integrated on iOS, anyone could try to track your behavior by placing an AirTag in your jacket, backpack or car. \n\nWith the app you can play a sound on AirTags and find it easily. Afterward, you can view at which locations the device has tracked you. For this we use background location access. All location data never leaves your device\n\nIf no one is trying to track you, the app will never bother you. \n\n<h2><b>How does it work?</h2></b>\n\nAirGuard uses Bluetooth scans of your Android phone to find AirTags and Find My trackers. Every tracker that is found will be saved locally on your device. \nWhenever a tracker gets detected multiple times the app will recognize this. It compares the locations where the tracker has been detected. \nIf a tracker is detected at least 3 times and the locations have changed (to make sure its not your neighbour) the app sends you a notification. \nIf this tracker is an AirTag you can play a sound to find it. \n\nAll this happens locally on your device and the private information, like location, tracker ids, etc will never leave your device. \n\n<h2><b>Who are we?</h2></b>\nWe are part of the Technical University of Darmstadt in Germany. This project is part of a scientific research from the Secure Mobile Networking Lab. Our goal is to protect privacy and to find out how many people are opposed to tracking.\nIn this app you can voluntarily participate in a research study that will share anonymized data with us. \n\nThis app will never get monetized by showing ads, in-app purchases or anything else. \n\nOur privacy policy can be found here: \nhttps://tpe.seemoo.tu-darmstadt.de/privacy-policy.html\n\nThis app is open-source: \nhttps://github.com/seemoo-lab/AirGuard\n\nDisclaimer\nAirTag, FindMy and iOS are trademarks of Apple Inc. \nWe are not working together with Apple Inc.","repo":{"author":"Niklas Bittner","repo":"https://github.com/seemoo-lab/AirGuard"},"version":"30a1fc67c6a5dde9cf8651a9d904f65c73f866ebfec4316952963a0028eb21e3","site":null,"source":"https://github.com/seemoo-lab/AirGuard","license_or_tos":"Apache-2.0","resources":null,"verified":false}