{"appId":"de.schliweb.sambalite","appShortcutName":"SambaLite","appDisplayName":"SambaLite","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/de.schliweb.sambalite_10100.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A lightweight, modern, and open-source Android client for SMB/CIFS shares.\nSambaLite is a lightweight, modern, and open-source Android client for SMB/CIFS shares (Samba). The goal is to provide a minimalist, reliable, and secure tool that allows users to access SMB shares on their local network - without any unnecessary features, ads, or bloat.\n\nThe app is designed for tech-savvy users who are looking for a lean, transparent solution and value privacy and open source.\n\nMain features:\n\n• Network Discovery: Automatically scan for SMB servers on your local network\n• Manage connections: Enter SMB server (hostname or IP) and share/path, username, password, optional domain (workgroup)\n• Manage multiple connections with individual names\n• Connection testing with clear error messages\n• Automatic, secure storage of credentials (Android Keystore)\n• File browser: Navigate through the share directory tree, display of name, type, size, and modification date\n• Folder operations: Upload and download entire folders using ZIP compression\n• Multi-file operations: Select and transfer multiple files with progress tracking\n• Background transfers: Large file operations continue in the background\n• Enhanced search: Find files and folders with progress indicator and cancel option\n• Refresh view (\"Pull-to-Refresh\")\n• Sorting options (name, date, size)\n• File operations: Download, upload, delete, rename, open with external app\n• Display file properties\n• Modern Material Design 3 interface with app logo colors\n• Dark/Light Mode (system default)\n\nSecurity & Privacy:\n• No telemetry or third-party connections\n• No unencrypted storage of sensitive data\n• Minimal permissions (only network and access to user-selected storage locations)\n\nSambaLite is the open-source Samba client for Android that many have wanted for years: Modern, lean, secure, without unnecessary features, but with everything needed for practical access to SMB shares.","repo":{"author":"egdels","repo":"https://github.com/egdels/SambaLite"},"version":"ed04f109f96e6f894dd473ce5a8051a1c9ba4d3f94d456a7ed5e0f540a8da07e","site":null,"source":"https://github.com/egdels/SambaLite","license_or_tos":"Apache-2.0","resources":null,"verified":false}