{"appId":"f:de.tutao.calendar","appShortcutName":"Tuta Calendar","appDisplayName":"Tuta Calendar","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/de.tutao.calendar_108.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Quantum-safe encrypted planner to schedule & manage your events & sync calendars\nTake your privacy to the next level with the secure Tuta Calendar app. This encrypted time-management tool is the most private way to organize your busy schedule – and it’s quick to navigate, comes with dark and light mode, plus, it’s perfectly integrated with the Tuta Mail app.\n\n\nSECURE CALENDAR\n\n* Quantum-safe encryption: End-to-end encrypted data exchange with all Tuta Calendar users and with users of other calendar apps (via optional password-protected event invites).\n* No ads, no tracking, and no data sharing: We protect your privacy.\n* Zero-knowledge architecture: Entire events, including event notifications, are encrypted and hidden from our servers. We do not know when your meetings are taking place, who they are with, or what they are about.\n* Based in Germany: All data is safeguarded by strict German data protection laws.\n* Fully GDPR-compliant\n\nFULLY FEATURED\n\n* **SYNC ON ALL DEVICES:** Your Tuta planner syncs automatically on all devices and browsers.\n* **RECURRING EVENTS:** Use daily, weekly, monthly, yearly or custom repetitions.\n* **MULTIPLE CALENDAR VIEWS:** Switch in one tap between agenda, daily, weekly, and monthly view.\n* **SYNC EXTERNAL CALENDARS:** Events will automatically sync if the owner adds or updates events or meetings on external calendars. Once subscribed, no action is needed.\n* **MANAGE UNLIMITED CALENDARS (paid feature):** You can toggle different calendars into view with a single press or leave all events visible for a complete overview.\n* **EVENT REMINDERS:** Never miss a date. Tuta’s zero-knowledge reminders make sure you never miss an appointment.\n* **LINK CALENDAR EVENTS TO EMAILS AND CONTACTS:** Your Tuta Calendar is directly linked to your Tuta Mail account, so when creating events you can easily invite your contacts or send invites to others via email.\n* **OFFLINE SUPPORT:** Independent standalone app so you can check your schedule both online and offline!","repo":{"author":"Tutao GmbH","repo":"https://github.com/tutao/tutanota"},"version":"34bcb87e98f953d57a87ddc5f4f7ed41085af3b1f31be6fd3ecab5e9ab2c8cef","site":null,"source":"https://github.com/tutao/tutanota","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,100,101,46,116,117,116,97,111,46,99,97,108,101,110,100,97,114,47,101,110,45,85,83,47,105,99,111,110,95,106,98,82,86,101,100,84,69,57,86,100,57,53,55,105,75,108,83,48,82,117,56,89,78,70,54,50,111,55,100,49,71,122,85,121,120,66,121,69,107,76,69,73,61,46,112,110,103]},"verified":false}