{"appId":"f:de.wger.flutter","appShortcutName":"wger Workout Manager","appDisplayName":"wger Workout Manager","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/de.wger.flutter_49.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Fitness/workout, nutrition and weight tracker\nFrom fitness lovers to fitness lovers – get your health organized with WGER, your Workout Manager!\n\nHave you already found your #1 fitness app and do you love to create your own sports routines? No matter what type of sporty beast you are – we all have something in common: We love to keep track of our health data <3\n\nSo we don’t judge you for still managing your fitness journey with your handy little workout log book but welcome to 2024!\n\nWe have developed a 100% free digital health and fitness tracker app for you, sized down to the most relevant features to make your life easier. Get started, keep training and celebrate your progress!\n\nwger is an Open Source project and all about:\n* Your Body\n* Your Workouts\n* Your Progress\n* Your Data\n\nYour Body:\nNo need to google for the ingredients of your favourite treats – choose your daily meals from more than 78000 products and see the nutritional values. Add meals to the nutritional plan and keep an overview of your diet in the calendar.\n\nYour Workouts:\nYou know what is best for your body. Create your own workouts out of a growing variety from 200 different exercises. Then, use the Gym Mode to guide you through the training while you log your weights with one tap.\n\nYour Progress:\nNever lose sight of your goals. Track your weight and keep your statistics.\n\nYour Data:\nwger is your personalized fitness diary – but you own your data. Use the REST API to access and do amazing things with it.\n\nPlease note: This free app is not based on additional fundings and we don’t ask you to donate money. More than that it is a community project which is growing constantly. So be prepared for new features anytime!\n\n#OpenSource – what does that mean?\n\nOpen Source means that the whole source code for this app and the server it talks to is free and available to anybody:\n* Do you want to run wger on your own server for you or your local gym? Go ahead!\n* Do you miss a feature and want to implement it? Start now!\n* Do you want to check that nothing is being sent anywhere? You can!\n\nJoin our community and become a part of sport enthusiasts and IT geeks from all over the world. We keep working on adjusting and optimizing the app customized to our needs. We love your input so feel free to jump in anytime and contribute your wishes and ideas!\n\n-> find the source code on https://github.com/wger-project\n-> ask your questions or just say hello on our discord Server https://discord.gg/rPWFv6W","repo":{"author":"Unknown","repo":"https://github.com/wger-project/flutter"},"version":"6b2e25a42e79e2737a42f2079c5a463666b8412b8f242d70670a23f7336da2b0","site":null,"source":"https://github.com/wger-project/flutter","license_or_tos":"AGPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,100,101,46,119,103,101,114,46,102,108,117,116,116,101,114,47,101,110,45,85,83,47,105,99,111,110,95,121,88,119,89,81,80,86,112,106,89,79,98,95,57,119,76,101,52,66,68,82,57,89,89,57,70,67,89,89,50,57,82,117,117,118,77,102,71,100,73,87,54,56,61,46,112,110,103]},"verified":false}