{"appId":"f:de.wivewa.dialer","appShortcutName":"Welefon","appDisplayName":"Welefon","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/de.wivewa.dialer_12.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":29,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Phone with API\nWelefon is a Phone App that is simple and modern at the same time. You can dial numbers and receive calls. It does not do anything you do not need, e.g. provide a contact list that your system contact App alrady contains.\n\nThe special feature of Welefon is an API that allows a seamlessly integration of other apps in your phone experience. The Welefon source code contains an example App that uses the API in the folder apidemoapp.\n\nUsing this API, other Apps can receive details about the current calls. Like the deprecated PhoneStateListener of Android, this contains the phone number. In contrast to the PhoneStateListener, you do not need to fear the removal of the API. Additionally, Welefon includes details of calls in the background, e.g. calls that are in the state \"hold\".\n\nWelefon can receive additional caller details from other Apps. This can be a caller name, a caller details action and a RemoteView. The received caller name is shown as you expect it, completly independent of the system contact list. If a detail action is provided, then you can tap on the name to jump directly to the right place in the other App.\n\nThe RemoteViews are the method that allows Widgets on your homescreen. The same method can be used to show additional details and controls in the call screen. This allows showing any extra details.\n\nOf course this is safe and secure: The Welefon API can only be used with your permission.\n","repo":{"author":"Unknown","repo":"https://codeberg.org/wivewa/wivewa-dialer-android"},"version":"5d41fe260f517fb66b5df0df97461d3289708b6bce42b5bfbdeaee380a349ee6","site":null,"source":"https://codeberg.org/wivewa/wivewa-dialer-android","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}