{"appId":"eu.weblibre.gecko","appShortcutName":"WebLibre: Private Browser","appDisplayName":"WebLibre: Private Browser","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/eu.weblibre.gecko_313.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64"]}},"displayImages":[],"description":"Browse privately, search locally. Organize tabs, block tracking, and use Tor.\n<b>WebLibre is a privacy-first browser that puts you in control.</b>\n\nBuilt on Mozilla’s Gecko engine, WebLibre combines powerful privacy features with advanced tab management and a personal local search engine—so your data stays on your device, not in the cloud.\n\n- <b>Personal Local Search Engine</b>\n  Instantly search across open tabs, browsing history, and your favorite web feeds—all indexed privately on your device. No third-party search engine required.\n\n- <b>Bangs: Direct Site Search</b>\n  Use thousands of “bangs” to search directly on popular websites, bypassing external search engines for faster, more private results.\n\n- <b>Tab Containers for Privacy & Organization</b>\n  Separate your browsing into containers for work, shopping, or personal use. Each container has its own cookies, settings, and can be locked with biometric authentication.\n\n- <b>Integrated Tor Proxy</b>\n  Route selected tabs or containers through the Tor network for enhanced anonymity and to bypass censorship—without leaving your browser.\n\n- <b>Tree View Tab Navigation</b>\n  Visualize and manage complex browsing sessions with hierarchical tab organization. Never lose track of your research or workflow.\n\n- <b>No Tracking, No Cloud Storage</b>\n  WebLibre never tracks you. All your data—searches, history, and feeds—remains on your device for maximum privacy.\n\nAdditional Highlights\n\n- <b>Biometric Authentication</b>: Lock sensitive tabs or containers with your fingerprint or face.\n- <b>Efficient Resource Use</b>: Lightweight tabs and persistent sessions for seamless multitasking.\n- <b>Open Source Foundations</b>: Built using trusted Mozilla components.\n\n<b>Take back control of your browsing. Download WebLibre and experience privacy, speed, and organization—your way.</b>\n","repo":{"author":"Unknown","repo":"https://github.com/FaFre/WebLibre"},"usrVersion":"47778de0affb039074a6ba354f287e4bcf84c895b2f741007ae2f56e4bc066a5","version":1762412049,"site":null,"source":"https://github.com/FaFre/WebLibre","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}