{"appId":"f.cking.software","appShortcutName":"BLE Radar","appDisplayName":"BLE Radar","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Konstantin Kulikov/https://github.com/Semper-Viventem/MetaRadar/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":29,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A tool to monitor, analyze and find BLE devices around you.\nBluetooth Radar in the background scans and analyzes Bluetooth Low Energy devices around you (eg smartwatches, headphones, speakers) and allows you to set complex rules to search for devices by specified filters. For example, by device name, address, location and time of discovery, manufacturer, and if an unknown device has been chasing you for a long time. Can be used to find your missing devices, or notify you if the device that you are looking for is nearby.\n\nDISCLAIMER\nThis project is developed solely for educational, security research, and personal investigative purposes. The author does not endorse or encourage any use of this software for unlawful or unethical activities. You are solely responsible for ensuring your use of this tool complies with all applicable laws and regulations.\n\nIn general, the app is capable:\n* Scan, analyze and track Bluetooth devices around;\n* Create flexible filters for the radar;\n* Deep analysis of the scanned BLE devices, getting data from the available GATT services;\n* Gatt services Explorer;\n* Define the device type by metadata;\n* Define approximate distance to the device.\n\nBluetooth Radar does not collect or send your personal or geolocation data. The project is fully opensource and available on GitHub.","repo":{"author":"Konstantin Kulikov","repo":"https://github.com/Semper-Viventem/MetaRadar"},"version":"f3f2912c826ef7a1ff26a474a1a6d654673442d4c8769f9b1e666c579f1c08ff","site":null,"source":"https://github.com/Semper-Viventem/MetaRadar","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}