{"appId":"io.ente.photos.fdroid","appShortcutName":"Ente Photos - Encrypted photo storage","appDisplayName":"Ente Photos - Encrypted photo storage","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/ente/https://github.com/ente-io/ente/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Backup, Organise, Share - Private photo storage with end-to-end encryption\nStore, share and discover your memories with Ente Photos. With end-to-end encryption, only you—and those you share with—can see your photos and videos. Ente Photos has lovingly protected over 200 million memories for people who trust us across all major platforms. Get started with 10 GB free.\n\nWhy Ente Photos?\n\nEnte Photos is designed for those who truly value their memories. With end-to-end encryption and secure backups in three locations, your photos stay truly private and safe. Powerful on-device AI helps you find faces and objects instantly, while curated stories bring cherished memories to the present. Share encrypted albums with loved ones, invite family at no extra cost, and lock sensitive images with a password. Available on mobile, desktop, and web, Ente preserves every pixel of your photos and videos.\n\nFeatures:\n\nEND-TO-END ENCRYPTED STORAGE: Your photos and videos are encrypted on your device, and then automatically backed up to the cloud.\n\nSHARE AND COLLABORATE: Let your family or friends add photos and videos to your albums. Everything, end-to-end encrypted.\n\nRELIVE YOUR MEMORIES: Through the stories Ente curates for you, relive your memories from previous years. Easily spread the cheer by sharing them with your loved ones or friends.\n\nSEARCH FOR ANYONE AND ANYTHING: Using on-device AI, Ente helps you find faces and key elements in a photo, so you can search through your entire library using natural language search.\n\nINVITE YOUR FAMILY: Invite up to 5 family members to any paid plan at no extra cost. Only your storage space is shared, not your data. Each member will receive their own private space.\n\nAVAILABLE EVERYWHERE: Ente Photos is available on iOS, Android, Windows, Mac, Linux and the web, so you can access your photos and videos from any device you have.\n\nNEVER LOSE YOUR PHOTOS: Ente stores your encrypted backups in 3 secure locations—including an underground facility—so your photos stay safe, no matter what.\n\nEASY IMPORT: Use our powerful desktop app to import data from other providers. If you need any help moving, reach out, and we'll be there.\n\nORIGINAL QUALITY BACKUPS: All photos and videos are stored in their original quality, including the metadata, without any compression or loss in quality.\n\nAPP LOCK: Make sure no one else can see your photos and videos using the built in App Lock. You can set a pin, or use biometrics to lock the app only for yourself.\n\nHIDDEN PHOTOS: Hide your most private photos and videos to the Hidden folder, which is password protected by default.\n\nFREE DEVICE SPACE: Free up your device's space by clearing files that have already been backed, in a single click.\n\nCOLLECT PHOTOS: Went to a party and want to collect all the photos in one place? Just share a link with your friends and ask them to upload.\n\nPARTNER SHARING: Share your camera album with your partner so they can automatically see your photos on their device.\n\nLEGACY: Allow trusted contacts to access your account in your absence.\n\nDARK & LIGHT THEMES: Choose the mode that will make your photos pop.\n\nADDITIONAL SECURITY: Turn on two-factor authentication or set a lock-screen for the app.\n\nOPEN-SOURCE AND AUDITED: Ente Photos’s code is open-source, and has been audited by third-party security experts.\n\nHUMAN SUPPORT: We take pride in providing real human support. If you need help, reach out to support@ente.io, and one of us will be there to assist you.\n\nKeep your memories safe and private, with Ente Photos. Get started with 10 GB free.\n\nVisit ente.io to learn more.","repo":{"author":"ente","repo":"https://github.com/ente-io/ente"},"version":"33e137dc793f15ed53372d6623125f4d356e058f67fa9ec4e2bebf2f6e951f45","site":null,"source":"https://github.com/ente-io/ente","license_or_tos":"AGPL-3.0-only","resources":null,"verified":false}