{"appId":"io.github.exclude0122.xivpn","appShortcutName":"XiVPN","appDisplayName":"XiVPN","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/io.github.exclude0122.xivpn_413.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64"]}},"displayImages":[],"description":"Proxy client based on XRAY\nXiVPN is a GUI wrapper for Xray that utilizes Android's built-in VPN feature to route internet traffic through the Xray core.\nIt aims to provide an intuitive user interface for all common Xray configurations, allowing non-technical users to take advantage of powerful features without writing complex JSON files.\n\nWhat is Xray?\nXray is a high-performance network proxy tool that supports multiple protocols including VLESS, VMess, Trojan, Shadowsocks, and more. Unlike traditional VPNs that route all traffic through a single server with standard protocols, Xray offers more flexibility and stealth capabilities. This makes Xray widely used in regions with high internet censorship where traditional VPNs (like WireGuard and openvpn) blocked.\n\nWhat unique does XiVPN offer?\n- Proxy Chains: Connect multiple proxy servers in sequence to create layered tunnels for better privacy\n- Proxy Group: Organize servers into groups and easily switch between different servers\n- Routing Rules: Routes internet traffic to different servers or groups based on IP address, port number, and domain name\n- Separate process for Xray core: Runs the Xray core as a separate process, preventing memory leaks during restarts and avoiding app-wide crashes caused by core panics\n","repo":{"author":"Exclude0122","repo":"https://github.com/Exclude0122/xivpn"},"usrVersion":"6eadfeb4d123385ad4644c2c37470eb2e8a1068bbba51423ca089c0edc7068d4","version":1768229663,"site":null,"source":"https://github.com/Exclude0122/xivpn","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}