{"appId":"f:io.kubenav.kubenav","appShortcutName":"kubenav","appDisplayName":"kubenav","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/io.kubenav.kubenav_89.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"Navigator for your Kubernetes clusters right in your pocket\nkubenav is a mobile app to manage Kubernetes clusters. The app provides an overview of all resources in a Kubernetes cluster, including current status information for workloads. The details view for resources provides additional information. It is possible to view logs and events or to get a shell into a container. You can also edit and delete resources or scale your workloads within the app.\n\n* Available mobile: kubenav provides the same experience as kubectl for mobile.\n* Manage Resources: All major resources like Deployments, StatefulSets, DaemonSets, Pods, etc. are supported.\n* Custom Resource Definitions: View all Custom Resource Definitions and mange Custom Resources.\n* Modify Resources: Edit and delete all available resources or scale your Deployments, StatefulSets, DaemonSets.\n* Filter and Search: Filter the resources by Namespace and find them by their name.\n* Status Information: Fast overview of the status of workloads and detailed information including Events.\n* Resource Usage: View the requests, limits and current usage of Pods and Containers.\n* Logs: View the logs of a container or stream the logs in realtime.\n* Terminal: Get a shell into a container, right from your phone.\n* Manage multiple Clusters: Add multiple clusters via `kubeconfig` or your preferred Cloud Provider, including Google, AWS and Azure.\n* Port-Forwarding: Create a port-forwarding connection to one of your Pods and open the served page in your browser.\n* Prometheus Integration: kubenav allows you to view your Prometheus metrics directly in the dashboard and to build your own dashboards via the Prometheus plugin.\n","repo":{"author":"Rico Berger","repo":"https://github.com/kubenav/kubenav"},"version":"a13b5aa7b0b10fdae6957bd3770e8090aec44e02b8e77e80c58d971f3714e2e3","site":null,"source":"https://github.com/kubenav/kubenav","license_or_tos":"MIT","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}