{"appId":"me.ahmetcetinkaya.whph","appShortcutName":"WHPH - Work Hard Play Hard","appDisplayName":"WHPH - Work Hard Play Hard","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/me.ahmetcetinkaya.whph_47.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":22,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"Productivity app for task management, habit tracking and time optimization\nWHPH is a comprehensive productivity app designed to help you manage tasks, develop new habits, and optimize your time. It tracks application usage to enhance focus, allowing you to analyze your progress, celebrate achievements, and stay motivated.\n\n<h3>Key Features:</h3>\n<ul>\n<li><strong>Task Management:</strong> Organize and track your daily tasks efficiently</li>\n<li><strong>Habit Tracking:</strong> Build and maintain positive habits with progress monitoring</li>\n<li><strong>Time Optimization:</strong> Analyze your time usage patterns and improve productivity</li>\n<li><strong>Application Usage Tracking:</strong> Monitor how you spend time on different applications</li>\n<li><strong>Progress Analysis:</strong> View detailed insights into your productivity patterns</li>\n<li><strong>Achievement System:</strong> Celebrate milestones and stay motivated</li>\n</ul>\n\n<h3>Why Choose WHPH?</h3>\n<p>WHPH combines multiple productivity tools into one unified experience. Whether you're looking to manage your daily tasks, build better habits, or understand how you spend your time, WHPH provides the insights and tools you need to enhance your productivity and achieve your goals.</p>\n\n<p>The app is designed with privacy in mind - all your data stays on your device, giving you complete control over your personal productivity information.</p>\n\n<h3>Supported Platforms:</h3>\n<ul>\n<li>Android</li>\n<li>Windows</li>\n<li>Linux</li>\n</ul>\n\n<p>Start your journey to better productivity today with WHPH!</p>\n","repo":{"author":"Ahmet Çetinkaya","repo":"https://github.com/ahmet-cetinkaya/whph"},"version":"1969b98012b2c59a9c83883b7df6db123a283a7238c68a7375c2d1849dca7c04","site":null,"source":"https://github.com/ahmet-cetinkaya/whph","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}