{"appId":"me.biplobsd.rsm","appShortcutName":"Running Services Monitor","appDisplayName":"Running Services Monitor","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/me.biplobsd.rsm_13.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"Monitor running services on your Android device with Shizuku integration\nRunning Services Monitor is a powerful Flutter application designed to help you monitor running services on your Android device. With a clean and intuitive interface, you can easily view system and user apps and check their status efficiently.\n\n<b>Features</b>\n\n* Monitor Running Services: View a comprehensive list of all running services on your device\n* Categorized View: Easily switch between All, User, and System apps\n* Search Functionality: Quickly find specific apps with the built-in search bar\n* App Details: Get detailed information about each app, including package name, version, and more\n* Shizuku Integration: Leverages Shizuku for advanced system interactions without root\n* Material Design 3: A modern and beautiful UI that adapts to your device's theme\n* Dark/Light Mode: Toggle between dark and light themes for comfortable viewing\n* Localization: Support for English and Bangla languages\n\n<b>Requirements</b>\n\nEssential:\n\n* Android 7.0 (API 24) or higher\n* Shizuku app installed and running\n* For Android 11+: Wireless Debugging enabled\n* For Android 10 and below: ADB connection to PC\n\nPermissions:\n\n* QUERY_ALL_PACKAGES - To list all installed apps\n* Shizuku permission - Granted through Shizuku app\n\n<b>How It Works</b>\n\nThis app uses Shizuku to execute privileged ADB commands without root access. Starting from Android 8.0 (API 26), the `ActivityManager.getRunningServices()` API was deprecated and restricted. Third-party apps can no longer query all running services on the device for privacy and security reasons.\nShizuku provides a solution by running a privileged service that can access system APIs, allowing apps to execute ADB commands without root, working on non-rooted devices via Wireless Debugging (Android 11+) or USB ADB.\nThe app connects to the Shizuku service running on your device, executes `dumpsys activity services` to get running service information, parses the dumpsys output to extract service details (package name, PID, process name, etc.), and categorizes services into System and User categories.\n\n<b>Limitations</b>\n\n* Due to Android security policies, some service information may be limited\n* Requires Shizuku to be running; service stops when device reboots\n* Dumpsys output format may vary across Android versions\n* This app only displays services; it cannot start/stop them\n\nThis app is designed for users who want to monitor running services on their device, similar to the \"Running Services\" feature that was available in Android Developer Options in older Android versions.","repo":{"author":"Biplob Kumar Sutradhar","repo":"https://github.com/biplobsd/running_services_monitor"},"usrVersion":"8d138bbbc2e21165c0f5e11481aefd61f95fc9f7d51f830389632cbfda43d1ac","version":1765873771,"site":null,"source":"https://github.com/biplobsd/running_services_monitor","license_or_tos":"MIT","resources":null,"verified":false}