{"appId":"mobi.maptrek","appShortcutName":"Trekarta","appDisplayName":"Trekarta","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Andrey Novikov/https://github.com/andreynovikov/trekarta/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Simple, responsive map for your trek\n<b>Trekarta</b> is designed for hiking, geocaching, off-roading, cycling, boating and all other outdoor activities. It uses offline maps so you do not need to have internet connection. You can easily import places and tracks from GPX and KML data formats or create places in application and share them to others. It lets you write the track of your journey, even in background, so you will never get lost and be able later see where you've been.\n\n<b>Offline maps</b>\nTrekarta uses OpenStreetMap based vector maps that are lightweight, offline and are constantly enhanced by contributors. Maps contain detailed topological data with elevation contours. Some map elements can be filtered out for cleaner look. Trekarta has built-in hillshades support. You can add custom maps in sqlite or mbtiles format to cover your area of interest. Custom maps will be shaded as well. Such maps can be created by yourself with SAS.Planet application from mostly any online source or converted with MapTiler and other applications from other map formats.\n\n<b>Hiking</b>\nSpecial hiking activity mode emphasises paths and tracks on map. It visualizes path difficulty and visibility and displays hiking routes. It also displays special OSMC symbols that help you identify desired route.\n\n<b>Cycling</b>\nCycling activity mode reveals bicycle infrastructure. It shows cycling routes and visualizes mountain biking track difficulty and visibility.\n\n<b>Skiing and skating</b>\nSkiing activity mode displays clean winter map with mostly all skiing activities: downhill, nordic, hiking and touring. As a bonus freestyle snow-boarding, skating and sleighing areas are displayed.\n\n<b>Off-road</b>\nUnpaved, dirt, winter and ice roads are specially visualized. 4wd only roads have specific marking. Fords are displayed on all roads, even primary.\n\n<b>Places</b>\nPlaces can be easily imported from GPX and KML files or can be created within application. You can navigate to places and share them with others.\n\n<b>Tracks</b>\nTrekarta is designed to record tracks of your journey. Simply press a button when you start and press it once more when you finish. You can quit the application if you do not need to look at the map, the track will be recorded in the background.\n\n<b>Plugins</b>\nTrekarta functionality can be extended by plugins. Currently the following plugins are available:\n* Location sharing\n* Dropbox sync\n\n<b>More info</b>\nMore information can be found at:\n<a href=\"https://github.com/andreynovikov/trekarta/\">https://github.com/andreynovikov/trekarta/</a>\n\nQuestions can be asked at:\n<a href=\"https://github.com/andreynovikov/trekarta/discussions\">https://github.com/andreynovikov/trekarta/discussions</a>","repo":{"author":"Andrey Novikov","repo":"https://github.com/andreynovikov/trekarta"},"version":"a3aa4651ea899198b9c57098ad26c7d06f29b43fe9e59b180abf3b8b1f532ad3","site":null,"source":"https://github.com/andreynovikov/trekarta","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}