{"appId":"net.retiolus.natinfo","appShortcutName":"NATINFo+","appDisplayName":"NATINFo+","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/net.retiolus.natinfo_32003.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64"]}},"displayImages":[],"description":"Advanced NATINF (NATure INFraction) search, offences under French law\nNATINFo+ is an example of a client application that can be used to search for and consult offences in the NATINF nomenclature via the NATINFo API (https://codeberg.org/retiolus/natinfo).\n\nWhat does ‘NATINF’ mean?\n\n‘NATINF is the nomenclature of French offences (NATure d'INFraction). This nomenclature is defined by the French Ministry of Justice. It is used by all legal services and government departments, in particular to record proceedings, monitor statistics, etc.’ - justice.gouv.fr\n\nFeatures\n\nThe application lets you search for an offence by NATINF number, title, article of law, code, etc., and consult all the information using the NATINFo API.\n\nIts main advantage over the natinfo.retiolus.net site is that it downloads all the available data on the first launch and stores it locally. This means you can consult it offline - with the added bonus of faster display times. The data is then updated automatically with each search when the connection is active.\n\nThe app is also customisable: light or dark theme, badge colour (fince/offence/crime), it provides a history of NATINF consultations and favourites management for quicker retrieval, and offers practical tools for calculating blood alcohol content, speed and locating road points.","repo":{"author":"retiolus","repo":"https://codeberg.org/retiolus/natinfo_flutter"},"version":"64f6c8f2fde4f3981532d8d4e862a9c5fba3ec76b3913fe3f2be4719b4d68d7e","site":null,"source":"https://codeberg.org/retiolus/natinfo_flutter","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}