{"appId":"f:net.stargw.contactsimport","appShortcutName":"Contacts Import","appDisplayName":"Contacts Import","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/net.stargw.contactsimport_37.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":14,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Import your CSV contacts from a desktop client without any cloud syncing.\nImport your CSV contacts from your favourite desktop client without any cloud syncing. Multi-language fully supported including all common localised codepages (from US & Westen Europe to Eastern Europe to China and Japan) and also UTF, so you get your contact information exactly how it should be on the phone.\n \nImport contacts from Excel CSV files with over 100 field mappings available. Popular address books formats fully supported to easily get your contacts from Microsoft Outlook and other applications onto your phone. Even has custom mapping features to give you full control over which contact fields you want to import on your phone\n\nYour imported Android contacts are kept on your phone and never synced with any Cloud service ever. With this app you will never have to give your contacts to Google, Yahoo, or any other Cloud service again. No need to install any sync bloatware programs on your PC. Your contacts will remain confidential to you.\n\nNote this is a one way import from your authorative CSV file. Contacts are imported onto a new account \"My Contacts\"|owned by the app. If you uninstall the app this account and contacts contained within it will be deleted. The idea is you leave the app on the phone, it does not run or use any resources when not being used. And use the app again to reimport the CSV when it changes. It is also recommended that you take backups and exports, and save outide the app.\n\n","repo":{"author":"StarGW","repo":"https://github.com/StarGW-net/contacts-import"},"version":"dec0208362f1f2bde96910e49d3df1ec8765901ad62da33831e2d63056a80eb2","site":null,"source":"https://github.com/StarGW-net/contacts-import","license_or_tos":"Apache-2.0","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,110,101,116,46,115,116,97,114,103,119,46,99,111,110,116,97,99,116,115,105,109,112,111,114,116,47,101,110,45,85,83,47,105,99,111,110,95,74,49,104,45,66,85,89,45,101,97,116,77,106,83,118,84,66,56,88,55,98,73,85,50,101,110,115,88,103,108,114,105,112,117,72,100,51,98,79,109,67,86,103,61,46,112,110,103]},"verified":false}