{"appId":"net.nymtech.nymvpn","appShortcutName":"NymVPN: Private Mixnet","appDisplayName":"NymVPN: Private Mixnet","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/net.nymtech.nymvpn_26000.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"The world's only VPN app that can't spy on you. Academic-designed, Swiss made.\nStop being tracked online. The only VPN that can't spy on you, even if it wanted to. Made in Switzerland, trusted by privacy advocates worldwide.\n\n⭐️ As seen in: PCMag, TechRadar, Wirecutter, ZDNet, Tom's Guide, Forbes, Bloomberg, TechCrunch, How-To Geek, PCWorld, Heise Online\n\nBROWSE WITHOUT LEAVING A TRACE\n\nTired of wondering who's watching? Traditional VPNs can theoretically log your activity. NymVPN is fundamentally different: our decentralized network makes centralized logging impossible by design. This isn't a \"no-logs policy\"—it's a \"can't log\" architecture.\n\n✓ True anonymity: Pay with crypto or cash, no email required\n✓ 50+ countries, hundreds of independent servers\n✓ Multi-device protection: 10 devices with one anonymous code\n✓ Swiss-based with academic-grade privacy standards\n\nCHOOSE YOUR PRIVACY LEVEL\n\n⚡ Fast Mode – Lightning-fast speeds for streaming and browsing. 2-hop by default so one server knows who you are, another knows what you're doing—but never both.\n🔒 Anonymous Mode – Maximum privacy through a 5-hop mixnet with noise-generating technology and up to 5 layers of encryption. Designed to resist even AI-powered traffic analysis and advanced surveillance.\n\nWHY NYMVPN IS DIFFERENT\n\n• Metadata protection – Unlike other VPNs, we protect not just your data but the patterns you leave behind\n• Censorship resistant – Access blocked information in restrictive environments with AmneziaWG, QUIC and stealth protocols\n• Zero-knowledge payments – Your subscription is cryptographically unlinked from your activity\n• University-designed – Built by PhD cryptographers from KU Leuven and EPFL with 20+ peer-reviewed publications\n\nINDEPENDENTLY VERIFIED\n\n• 4 security audits (2021-2024) by JP Aumasson, Oak Security, Cryspen, Cure53\n• Open-source and transparent (\"Signals of Trustworthy VPNs\")\n• 10,000+ users already trust NymVPN for their privacy\n\nESSENTIAL FEATURES\n\n• High-speed connections with 50+ country selection\n• Kill switch prevents data leaks\n• Completely ad-free experience\n• State-of-the-art cryptographic stack\n\n\nPERFECT FOR\n\n→ Streaming and browsing without being tracked by advertisers\n→ Secure public WiFi connections at cafes, airports, hotels\n→ Anyone in restrictive countries needing reliable access\n→ People who want true anonymity, not just hidden IP addresses\n→ Journalists and activists needing untraceable communication\n\nDownload now. Connect in seconds. Disappear online.\n\n🎁 7-day free trial | 💯 30-day money-back guarantee | 🌐 Trusted by 10,000+ users worldwide","repo":{"author":"Unknown","repo":"https://github.com/nymtech/nym-vpn-client"},"usrVersion":"637dd1e5eaaabc1612583b697cb5e77a706bd5c2c944d679618d94494fc1f263","version":1767693043,"site":null,"source":"https://github.com/nymtech/nym-vpn-client","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}