{"appId":"net.nymtech.nymvpn","appShortcutName":"NymVPN – Private VPN","appDisplayName":"NymVPN – Private VPN","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/net.nymtech.nymvpn_27000.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"The World’s Most Private VPN\n7 day free trial: All features, no ads, cancel anytime.\n\nThe only VPN that can't spy on you. Made in Switzerland. Built by privacy-advocates. The world’s first mixnet for online anonymity.\n\n- NO NAME SIGNUP: No email required. Zero-knowledge accounts. The most crypto accepted by any VPN. Cash payments accepted for full anonymity.\n- DECENTRALIZED VPN technology\n- 65+ COUNTRIES with hundreds of independent servers\n- UP TO 10 DEVICES with one anonymous code\n\nBROWSE WITHOUT A TRACE\n\nTired of wondering who's watching you? Corporations collecting your personal data? Not being able to access information because of where you are?\n\nWhile other VPNs promise not to keep logs, the NymVPN network is designed so centralized logs are not possible. No point on the decentralized network can connect your IP address with what you do online. Your privacy is guaranteed by default.\nWhen you connect with NymVPN, your online activity cannot be tied back to you by advertisers, network operators, or centralized infrastructure. You can browse, research, and communicate without creating a behavioral fingerprint that follows you across the internet.\n\n\nCHOOSE YOUR PRIVACY LEVEL\n\nFast Mode\n- High-speed browsing and streaming\n- 2-hop decentralized VPN\n- Choose entry and exit servers in 65+ countries\n\n\nAnonymous Mode\n- Maximum anonymity for messaging, email, and financial transactions\n- 5-hop Noise Generating Mixnet\n- Designed to resist advanced traffic analysis\n\nESSENTIAL FEATURES\n\n- High-speed connections with 65+ country selection\n- Multi-layer encryption\n- dVPN AmneziaWG (WireGuard) support\n- Kill switch prevents data leaks\n- Advanced anti-censorship technology\n- Split tunneling\n- Custom DNS\n- dApp & wallet mode for private & secure Ethereum crypto transactions \n- Key rotation for cryptographic security\n- Completely ad-free experience\n- Fully open source \n\nWHY NYMVPN IS DIFFERENT\n\nMost VPNs rely on centralized servers and ask you to trust their “no-logs” promises. NymVPN is built differently.\n- Decentralized VPN (dVPN) architecture: Traffic is routed through independently operated nodes. There is no single server that can see both who you are and what you do online.\n\n- Metadata protection, not just encryption: NymVPN protects traffic patterns, timing, and routing information. Even encrypted data can leak metadata. Nym is designed to prevent that.\n\n- Noise Generating Mixnet technology: In Anonymous Mode, your traffic is mixed with cover traffic across multiple hops, making correlation and AI-driven traffic analysis extremely difficult.\n\n- Two privacy modes, one app: Fast Mode uses a high-performance 2-hop decentralized VPN.\n Anonymous Mode uses a 5-hop mixnet for maximum anonymity.\n\n- Zero-knowledge accounts by design: No email signup. No personal data. Accounts are unlinkable from usage. Supports crypto and cash payments for full anonymity.\n\n- Censorship-resistant networking: Built with AmneziaWG, QUIC, and stealth transport options to work in restrictive environments.\n\n- Open-source and independently audited: Fully open source, with multiple third-party security audits by Cure53, Cryspen, Oak Security, and JP Aumasson.\n\n- Built by academic cryptographers: Designed by researchers from KU Leuven and EPFL with 20+ peer-reviewed publications in privacy and cryptography.\n\nINDEPENDENTLY VERIFIED\n- Audited by Cure53, Cryspen, Oak Security, JP Aumasson\n- Featured in PCMag, TechRadar, Forbes, Bloomberg\n- Trusted by 10,000+ privacy-focused users\n\nNYMVPN IS PERFECT FOR:\n\n- Streaming and browsing without being tracked by advertisers\n- Secure public WiFi connections at cafes, airports, hotels\n- Anyone in restrictive countries needing reliable access\n- People who want true anonymity, not just hidden IP addresses\n- Journalists and activists needing untraceable communication\n\nDownload now. Signup anonymously. Go dark with NymVPN. ","repo":{"author":"Unknown","repo":"https://github.com/nymtech/nym-vpn-client"},"usrVersion":"e4566bd7a3ca0a0be44886d77958fa2ca1d266e562e2ae93965ed4844c46df8b","version":1769183410,"site":null,"source":"https://github.com/nymtech/nym-vpn-client","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}