{"appId":"net.nymtech.nymvpn","appShortcutName":"NymVPN: Private Mixnet","appDisplayName":"NymVPN: Private Mixnet","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/net.nymtech.nymvpn_21000.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"The world's only VPN app that can't spy on you. Academic-designed, Swiss made.\nStop Being Tracked: The Only VPN That Can't Spy on You\n\nTired of being watched online? Traditional VPNs route your data through a single, centralized server that could theoretically track you. NymVPN is fundamentally different. Our decentralized network has no central authority, which means centralized logs are not possible. This isn't just a \"no-logs\" policy; it's a \"can't log\" design that puts you back in control of your digital life.\n\nBuilt by a world-class team of PhD researchers and cryptographers with over 20 peer-reviewed publications, NymVPN operates across hundreds of independent servers in 50+ countries. Developed in partnership with leading universities KU Leuven and EPFL and headquartered in privacy-focused Switzerland, our mission is to bring privacy to all humanity.\n\nCHOOSE YOUR LEVEL OF PRIVACY\n- Fast Mode: A lightning-fast 2-hop connection using the censorship-resistant AmneziaWG protocol. The first hop knows who you are but not what you're doing; the second hop sees your activity but not who you are, giving you a balance of speed and enhanced privacy.\n- Anonymous Mode: For maximum privacy, this mode routes your traffic through a 5-hop mixnet with up to 5 layers of encryption. This adds protective noise and dummy packets to your traffic, making it impossible for even advanced AI surveillance and traffic analysis to track you.\n\nWHY NYMVPN IS DIFFERENT\n- True Anonymity: Our zero-knowledge payments mean no email, no name, and no trace; Pay with crypto or cash—your subscription is cryptographically unlinked from your online activity\n- Metadata Protection: Unlike other VPNs, we protect not only the content of your traffic but also the traffic patterns you leave behind\n- Censorship Resistant: NymVPN is designed to help you access blocked sites and information in restrictive environments (with AmneziaWG and other upcoming features)\n- Multi-Device Protection: A single anonymous access code protects up to 10 of your devices\n\nINDEPENDENTLY VERIFIED\n- Four security audits (2021-2024) by reputable researchers including JP Aumasson, Oak Security, Cryspen, and Cure53\n- 20+ peer-reviewed publications in leading privacy & security conferences\n- Transparency via \"Signals of Trustworthy VPNs\" questionnaire by Center for Democracy & Technology\n\nESSENTIAL FEATURES\n- Kill switch to prevent data leaks\n- Global gateway selection in 50+ countries\n- Completely ad-free experience\n- State-of-the-art cryptographic stack\n\nCOMING FEATURES (2025)\nWe are actively developing new features to bring you a truly private internet, with plans for:\n- Split tunneling\n- Residential IPs\n- Post-quantum cryptography\n- Advanced censorship resistance (including QUIC protocol and stealth APIs)\n\nDownload, connect, disappear—become invisible online in seconds. Try NymVPN risk-free with our 30-day money-back guarantee.","repo":{"author":"Unknown","repo":"https://github.com/nymtech/nym-vpn-client"},"usrVersion":"17ba6744e5a0cad6d18f180c22063e08dcb4d89863c445f49efea028830fcd9b","version":1762722969,"site":null,"source":"https://github.com/nymtech/nym-vpn-client","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}