{"appId":"f:org.secuso.privacyfriendlydame","appShortcutName":"Checkers (Privacy Friendly)","appDisplayName":"Checkers (Privacy Friendly)","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.secuso.privacyfriendlydame_4.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"(SECUSO) Strategy board game for 2 players. Play against an AI or each other!\nPrivacy Friendly Checkers is a strategy board game for two players. The objective of the game is to either capture all opposing game pieces by jumping over them or by creating a situation in which the opponent cannot make a move anymore due to being blocked.\n\nPrivacy Friendly Checkers features two game modes: one game mode allows playing versus a computer-controlled opponent and the second game mode is for two human-controlled players using the same device. The game board consists of 8x8 squares and each player starts with 12 game pieces. The white player begins and then both players alternate taking turns. Furthermore, color-highlighting is used to graphically emphasize which moves are allowed to be made and the interface displays which game pieces have already been captured so the game progress can be tracked more easily. Additionally, the app automatically saves the last game status so it is possible to resume a previously started game at a later time.\n\nHow does Privacy Friendly Checkers differ from other similar apps?\n\n1) No permissions\n\nPrivacy Friendly Dame does not require any permissions.\n\n2) No advertisement\n\nMoreover, Privacy Friendly Dame completely relinquishes advertisement. Many other apps in the Google Play Store display advertisement and therefore might violate the users privacy, shorten battery life or use mobile data.\n\nPrivacy Friendly Checkers is part of the Privacy Friendly Apps group developed by the research group SECUSO at Karlsuhe Institute of Technology. More information at: https://secuso.org/pfa\n","repo":{"author":"SECUSO - Security Usability Society","repo":"https://github.com/SecUSo/privacy-friendly-dame"},"version":"20b1f9869401772b9e8370e2280caf408a58bcdc81aaa0ac4d84819b18cac925","site":null,"source":"https://github.com/SecUSo/privacy-friendly-dame","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}