{"appId":"org.secuso.privacyfriendlyweather","appShortcutName":"Weather (PFA)","appDisplayName":"Weather (PFA)","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/SECUSO - Security Usability Society/https://github.com/SecUSo/privacy-friendly-weather/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":17,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"(SECUSO) Lets you watch the weather for cities and locations of your choice\nPrivacy Friendly Weather lets you watch the weather for cities and locations you are interested in. The app has been developed by the research group SECUSO at Karlsruhe Institute of Technology. More info can be found on https://secuso.org/pfa\n\nThe weather includes current weather as well as a hourly and daily forecasts. The weather data includes details such as temperature, a short description of the current weather condition and humidity, wind and rain. A dark theme as well as 4 different home screen widgets are availble with current day or future day informations.\nFurthermore, Privacy Friendly Weather provides a radius search. This makes it possible to find the locations around a given location which have the best weather conditions at the moment. The search space can be set by the user.\nThe unit of temperatures can be set to Celsius or Fahrenheit and the unit of distances to kilometres or miles. Multiple wind units are available also.\n\nAll weather data is retrieved from the OpenWeatherMap by using their API (http://openweathermap.com/api) which provides a free service.\n\n1. Minimum permissions\nPrivacy Friendly Weather requires only the minimum amount of permissions, the INTERNET permission which is necessary to make HTTP requests to remote servers for retrieving weather data. The two other permissions for binding services and keeping the phone awake are needed for background data handling.\n\n2. Radius Search\nFind the locations around a given location which have the best weather conditions at the moment.\n\n3. No advertisement\nOther free apps display advertisement which might result in privacy violations, shorten the device's battery life or use mobile data.\n\nYou can reach us via\nTwitter - @SECUSOResearch https://twitter.com/secusoresearch\nMastodon - @SECUSO_Research@bawü.social https://xn--baw-joa.social/@SECUSO_Research/\nJob opening - https://secuso.aifb.kit.edu/english/Job_Offers_1557.php","repo":{"author":"SECUSO - Security Usability Society","repo":"https://github.com/SecUSo/privacy-friendly-weather"},"version":"e4dbfda5fb7b62b56c7a1a01f338809c850158384b75ea058325f937ccf4625f","site":null,"source":"https://github.com/SecUSo/privacy-friendly-weather","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}