{"appId":"f:org.fossify.voicerecorder","appShortcutName":"Fossify Voice Recorder","appDisplayName":"Fossify Voice Recorder","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.fossify.voicerecorder_5.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Record anything with this Open-source and Ad-free recorder\nIntroducing Fossify Voice Recorder – where capturing crystal-clear audio and preserving precious moments is effortless and enjoyable. Seamlessly blend simplicity with functionality as you embark on a journey of seamless recording experiences tailored to your needs.\n\n🔊 HIGH-QUALITY AUDIO CAPTURE:\nRemember every word, every note, and every emotion with pristine audio quality. Fossify Voice Recorder empowers you to capture high-fidelity recordings effortlessly, ensuring that every detail is preserved with clarity and precision.\n\n🎙️ VERSATILE RECORDING OPTIONS:\nFrom voice memos to musical inspirations, this intuitive app transforms your device into a versatile recording studio. Explore the freedom to document your surroundings and unleash your creativity with ease.\n\n🚀 NO-FUSS FUNCTIONALITY:\nEnjoy a clutter-free experience with Fossify Voice Recorder. Say goodbye to unnecessary features and hello to a streamlined interface designed for intuitive navigation and seamless recording.\n\n📊 INTUITIVE VISUALIZATION:\nImmerse yourself in the recording process with real-time sound volume visualization. Experience the thrill of monitoring your recordings with a sleek, interactive display that enhances your recording experience.\n\n🔒 PRIVACY-FIRST APPROACH:\nRest easy knowing that your privacy is our priority. Fossify Voice Recorder operates offline, ensuring maximum privacy, security, and stability without the need for internet access. Your recordings remain confidential and under your control at all times.\n\n🎨 CUSTOMIZABLE INTERFACE:\nPersonalize your recording experience with customizable colors and themes. Embrace the sleek elegance of material design and dark theme options, offering a visually stunning experience tailored to your preferences.\n\n🤝 USER-FRIENDLY FEATURES:\nDiscover intuitive functionalities like customizable filename formats and practical widgets for quick recordings. With Fossify Voice Recorder, the power to record is in your hands.\n\n🌐 AD-FREE & OPEN-SOURCE:\nSay goodbye to intrusive ads and unnecessary permissions. Fossify Voice Recorder is ad-free, fully open-source, and grants you the freedom to use the app as you please, without compromise.\n\nCapture moments, preserve memories, and unleash your creativity with Fossify Voice Recorder. Download now and experience recording like never before.\n\nExplore more Fossify apps: https://www.fossify.org\nOpen-Source Code: https://www.github.com/FossifyOrg\nJoin the community on Reddit: https://www.reddit.com/r/Fossify\nConnect on Telegram: https://t.me/Fossify\n","repo":{"author":"Fossify","repo":"https://github.com/FossifyOrg/Voice-Recorder"},"version":"dae66a6a266fd94ad4beb013ee81a70f09b5361cc78bd8296c7d33c5fd7192d3","site":null,"source":"https://github.com/FossifyOrg/Voice-Recorder","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,102,111,115,115,105,102,121,46,118,111,105,99,101,114,101,99,111,114,100,101,114,47,101,110,45,85,83,47,105,99,111,110,95,75,89,118,99,68,106,112,102,108,102,67,71,50,69,52,107,80,78,54,105,112,122,45,81,57,114,83,100,76,74,102,71,105,85,50,109,74,51,77,117,78,108,111,61,46,112,110,103]},"verified":false}