{"appId":"f:org.secuso.privacyfriendlycircuittraining","appShortcutName":"Circuit Training (PFA)","appDisplayName":"Circuit Training (PFA)","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.secuso.privacyfriendlycircuittraining_4.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A timer for circuit training with custom exercises\nPrivacy Friendly Circuit Trainer is an Android App that supports the user\nduring his/her circuit training session. It provides a configurable set of\ntimers for the exercises and the rest phases as well as multiple other\nfeatures.\n\n<b>Workout Timer</b>\n\nAfter configuring the set of timers in the main menu you can start the\nworkout routine by pressing the start button. The workout view has\nanimations and sound output features which can be turned on and off inside the settings menu.\n\n<b>Motivation Alert</b>\n\nThe app can show you motivation alerts to remind you of planned workout\nsessions. You can define the time of day and the notification texts inside the settings menu.\n\n<b>Block Periodization</b>\n\nWhen scheduling the timers you may also choose the block periodization\nfeature. This feature allows you to configure longer, separate breaks in\nbetween the exercises. This way the workout can be split into multiple high\nintensity  workout cycles.\n\n<b>Workout History</b>\n\nThe app can collect statistics about your performed workout sessions. The\ncollected data comprises of the time spend working out and the calories\nburnt while exercising. The accuracy of the calories calculation can be\nimproved by configuring the necessary user data in the settings menu. The\ncollection of this data can be deleted as well as turned on and off inside the settings menu.\n\n<b>Exercise Sets</b>\n\nThe app allows you to create your own Exercise Sets for the circuit\ntraining. Therefore you can combine your own  exercises to exercise sets.\nThe image assigned to an exercise is displayed during the workout. In\naddition, the exercise sets can be repeated during a workout. For this you\ncan set the number of rounds before starting the workout.\n\nThe app belongs to the Privacy Friendly Apps group developed by the\nresearch group SECUSO at the Karlsruhe Institute  of Technology.","repo":{"author":"SECUSO - Security Usability Society","repo":"https://github.com/SecUSo/privacy-friendly-circuit-training-exercises"},"version":"fcab1a55d90c3f55f665c7cb3113bb22be2fe43c5b7b978a4400d5422e63c66a","site":null,"source":"https://github.com/SecUSo/privacy-friendly-circuit-training-exercises","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,115,101,99,117,115,111,46,112,114,105,118,97,99,121,102,114,105,101,110,100,108,121,99,105,114,99,117,105,116,116,114,97,105,110,105,110,103,47,101,110,45,85,83,47,105,99,111,110,95,76,77,78,88,66,56,78,51,56,98,52,101,116,103,83,65,121,73,118,117,56,53,89,80,83,84,108,106,95,102,53,108,114,119,122,87,105,114,110,110,49,109,111,61,46,112,110,103]},"verified":false}