{"appId":"org.ojrandom.paiesque","appShortcutName":"PAIesque","appDisplayName":"PAIesque","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/org.ojrandom.paiesque_27.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A transparent, device-agnostic cardiovascular fitness and RHR tracker.\n<p><b>PAIesque: A Cardiovascular Fitness Tracker</b></p>\n\n<p><b>Prerequisite</b> To get started, you must first install and configure <b>Gadgetbridge</b> to collect heart rate data from your compatible fitness tracker or smartwatch.</p>\n\n<p>PAIesque calculates a transparent, <b>heart-rate-reserve-based cardiovascular fitness score</b> and tracks your Resting Heart Rate (RHR). It provides a device-agnostic, privacy-focused alternative to proprietary health metrics.</p>\n\n<p><b>The Score:</b> Unlike a \"black box\" algorithm, PAIesque calculates your fitness score using a <b>fully disclosed formula</b> based on the established Karvonen Heart Rate Reserve (HRR) method, inspired by research from the <a href=\"https://www.ntnu.edu/cerg\">NTNU Cardiac Exercise Research Group (CERG)</a>. This provides a consistent, science-inspired metric for tracking cardiovascular activity levels, independent of wearable brand or ecosystem.</p>\n\n<p><b>Key Differentiators:</b></p>\n<ul>\n<li><b>Open & Transparent:</b> Every calculation is visible and verifiable. It is <b>not</b> a reverse-engineered clone but a principled, open-source implementation of HRR-based scoring.</li>\n<li><b>Universal & Consistent:</b> Get the same scoring methodology across any fitness tracker supported by <a href=\"https://gadgetbridge.org/\">Gadgetbridge</a> (Amazfit, Garmin, Xiaomi, Fitbit, and 100+ more). Your historical data remains comparable even if you switch devices.</li>\n<li><b>Privacy-First & Local:</b> All processing happens on your device. Your heart rate data never leaves your phone, and no internet connection or subscription is required.</li>\n</ul>\n\n<p><b>Note:</b> This is an independent, community-developed application. While based on public scientific principles of heart rate reserve and long-term health, it is <b>not affiliated with or endorsed by NTNU CERG</b>, and its score is distinct from the proprietary <b>Personal Activity Intelligence (PAI®)</b> metric.</p>\n","repo":{"author":"OJ Random","repo":"https://codeberg.org/ojrandom/paiesque"},"usrVersion":"9066c09f71a06f34a593914cd8e876e5e286f03ab2213c27cbfe62726f0d3aaa","version":1765140063,"site":null,"source":"https://codeberg.org/ojrandom/paiesque","license_or_tos":"MIT","resources":null,"verified":false}