{"appId":"org.crazydan.studio.app.ime.kuaizi","appShortcutName":"Kuaizi IME","appDisplayName":"Kuaizi IME","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Crazydan Studio/https://github.com/crazydan-studio/kuaizi-ime-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Kuaizi IME is an efficient and fast Chinese Pinyin input method.\nKuaizi IME abandons the traditional method of tapping virtual keyboard keys one by one and instead uses a sliding screen method to input Pinyin. By carefully designing the key layout in accordance with the limited combination characteristics of Pinyin letters, it makes Pinyin input more accurate and convenient.\n\nKuaizi IME also provides cursor movement and text selection editing support for the target editor, thereby completely eliminating the frustration of being unable to accurately position input and text due to the small screen size of mobile devices. This further enhances text input and editing efficiency on small-screen devices.\n\nUser data for Kuaizi IME is stored locally only, it does not connect to the internet and does not collect or analyze user data and behavior habits. It also does not support or provide association input and fuzzy matching mechanisms. To some extent, this input method aims to strengthen users' recognition and memory of Hanzi and Pinyin, hoping to prevent the gradual forgetting and eventual abandonment of Hanzi —— the treasure of Chinese civilization —— due to reliance on digital tools.\n","repo":{"author":"Crazydan Studio","repo":"https://github.com/crazydan-studio/kuaizi-ime-android"},"version":"047b7810b3b273472264a4c9b1a2e6f1303a95f1e4cd29a726b8e25fec827b07","site":null,"source":"https://github.com/crazydan-studio/kuaizi-ime-android","license_or_tos":"LGPL-3.0-or-later","resources":null,"verified":false}