{"appId":"org.ojrandom.paiesque","appShortcutName":"PAIesque","appDisplayName":"PAIesque","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/org.ojrandom.paiesque_28.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A transparent, device-agnostic cardiovascular fitness and RHR tracker.\n<p>An Android app that helps you <strong>track and improve your cardiovascular health</strong> using your heart rate data. It calculates a <strong>personalized activity score</strong> and monitors your <strong>Resting Heart Rate (RHR)</strong>, giving you clear, actionable insights into your fitness progress—all on your device, with no subscriptions or data sharing.</p><p><b>Prerequisite</b> To get started, you must first install and configure <b>Gadgetbridge</b> to collect heart rate data from your compatible fitness tracker or smartwatch.</p><p><strong>How It Works &amp; Why It Helps You:</strong></p> <p>PAIesque is inspired by public research from the <a href=\"https://www.ntnu.edu/cerg\">NTNU Cardiac Exercise Research Group (CERG)</a>. Their foundational studies on the PAI (Personal Activity Intelligence) metric demonstrated a powerful finding: <strong>\"Our research shows that those who achieve 100 PAI or more every week over time live on average eight years longer than others.\"</strong></p> <p>While PAIesque does NOT use the official PAI® algorithm (that is not known anyway), it applies this same, powerful principle: <strong>use your heart rate to measure exercise intensity and reward consistent, heart-healthy activity.</strong> The app provides a transparent <a href=\"https://www.omnicalculator.com/health/karvonen-formula\">HRR-based</a> simplified <a href=\"https://www.firstbeat.com/en/blog/what-is-trimp\">Trainings Impuls Method</a> (TRIMP) to help you target the same research-backed goal of <strong>100 points per week.</strong></p> <p>Your score rises faster when your heart works harder—so both brisk walks and vigorous workouts move you toward your goal. By aiming for <strong>100 points per week</strong>, you have a science-inspired, consistent target to support your cardiovascular fitness, regardless of which wearable or activity tracker you use.</p><p><strong>Key Differentiators:</strong></p> <ul> <li><strong>Open &amp; Transparent:</strong> Unlike “black box” scores, every calculation is based on the disclosed <a href=\"https://www.omnicalculator.com/health/karvonen-formula\">Karvonen Heart Rate Reserve</a> (HRR) method. You always know how your score is determined.</li> <li><strong>Universal &amp; Consistent:</strong> Use it with almost any fitness tracker supported by <a href=\"https://gadgetbridge.org/\">Gadgetbridge</a> (Amazfit, Garmin, Xiaomi, Fitbit, 100+ devices). Your scoring method stays the same even if you change devices.</li> <li><strong>Privacy-First &amp; Local:</strong> Everything is processed on your phone. Your heart rate data never leaves your device, and no internet connection or account is required.</li> </ul><p><strong>Note:</strong> This is an independent, community-developed application. It is based on public scientific principles and foundational exercise physiology methods but is <strong>not affiliated with or endorsed by NTNU CERG</strong>, and its score is distinct from the proprietary <strong>Personal Activity Intelligence (PAI®)</strong> metric.</p>\n","repo":{"author":"OJ Random","repo":"https://codeberg.org/ojrandom/paiesque"},"usrVersion":"900c597b7e429c59a22ac51642432af887b431b2c292aa4322c4ed4edd077157","version":1765614283,"site":null,"source":"https://codeberg.org/ojrandom/paiesque","license_or_tos":"MIT","resources":null,"verified":false}