{"appId":"f:org.fossify.clock","appShortcutName":"Fossify Clock","appDisplayName":"Fossify Clock","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.fossify.clock_1.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Handy, lightweight, open-source clock app with essential features.\nIntroducing Fossify Clock – the ultimate timekeeping companion designed to enhance your daily routines and promote better sleep habits. With a multitude of functions tailored to your needs, Fossify Clock seamlessly integrates into your life, offering unparalleled convenience and versatility.\n\n⌚ MULTIFUNCTIONAL TIMEKEEPING:\nExperience the power of versatile time management with Fossify Clock. From serving as a clock widget to functioning as an alarm clock and stopwatch, this app is your go-to tool for regulating your daily activities and improving your overall lifestyle.\n\n⏰ FEATURE-RICH ALARM:\nWake up refreshed with Fossify Clock's comprehensive alarm features. Set multiple alarms with options like day selection, vibration toggle, custom labels and ringtone customization. Enjoy gradual volume increase and a customizable snooze button for a pleasant waking experience. With a user-friendly interface, setting up alarms has never been easier.\n\n⏱️ CONVENIENT STOPWATCH:\nTrack your activities with precision using Fossify Clock's stopwatch function. Measure longer periods or individual laps effortlessly. You can also sort your laps in ascending or descending order.\n\n⏳ PRECISE TIMER FUNCTIONALITY:\nStay on top of your tasks with Fossify Clock's versatile timer feature. Customize ringtone preferences, toggle vibrations, and pause countdowns to suit your needs. Whether you're timing cooking intervals, managing study sessions, or ensuring timely breaks, Fossify Clock has you covered with precision and ease.\n\n🌈 CLOCK WIDGET WITH CUSTOMIZABLE FEATURES:\nTransform your home screen with Fossify Clock's customizable clock widget. Adjust text color, background color, and transparency. Choose between analog or digital clock to suit your style and easily access essential time information at a glance.\n\n🎨 CUSTOMIZABLE INTERFACE AND THEMES:\nEnjoy a personalized experience with Fossify Clock's material design and dark theme options. Tailor the app to your preferences with customizable colors and themes, enhancing usability and reducing eye strain, especially in low-light environments.\n\n🔒 PRIVACY-FIRST APPROACH:\nRest assured knowing your privacy is protected with Fossify Clock's offline operation. Experience maximum privacy, security, and stability without sacrificing functionality or convenience.\n\n🌐 AD-FREE & OPEN-SOURCE:\nSay goodbye to intrusive ads and unnecessary permissions. Fossify Clock is ad-free, fully open-source, and grants you complete control over your timekeeping experience.\n\nUpgrade your time management skills, optimize your routines, and prioritize better sleep with Fossify Clock. Download now and take control of your time like never before.\n\nExplore more Fossify apps: https://www.fossify.org\nOpen-Source Code: https://www.github.com/FossifyOrg\nJoin the community on Reddit: https://www.reddit.com/r/Fossify\nConnect on Telegram: https://t.me/Fossify\n","repo":{"author":"Fossify","repo":"https://github.com/FossifyOrg/Clock"},"version":"410143c5d53106376bace38811a9559dad843b09ed0b8783c79809380a1bef0e","site":null,"source":"https://github.com/FossifyOrg/Clock","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,102,111,115,115,105,102,121,46,99,108,111,99,107,47,101,110,45,85,83,47,105,99,111,110,95,73,50,100,89,110,110,82,75,84,72,49,101,108,102,75,109,100,51,85,107,122,45,120,109,67,84,48,107,98,113,50,82,67,77,85,45,116,116,97,81,118,114,103,61,46,112,110,103]},"verified":false}