{"appId":"f:org.fossify.keyboard","appShortcutName":"Fossify Keyboard","appDisplayName":"Fossify Keyboard","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.fossify.keyboard_3.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Simple and open-source offline keyboard with emojis\nIntroducing Fossify Keyboard – your go-to solution for effortless and efficient typing. Experience a seamless typing experience designed to cater to all your needs, whether chatting with friends or inserting texts, numbers, or symbols.<br><br>\n<b>📶 OFFLINE FUNCTIONALITY:</b><br>\nFossify Keyboard operates entirely offline without internet permission, allowing you to use it anytime, anywhere, without needing an internet connection. This also provides you with more privacy, security, and stability compared to other keyboards that connect to the internet.<br><br>\n<b>🌐 MULTIPLE LANGUAGES AND LAYOUTS:</b><br>\nChoose from a wide variety of languages and keyboard layouts. Fossify Keyboard supports multiple languages, making it easy for you to switch and type in your preferred language effortlessly.<br><br>\n<b>📋 HANDY CLIPBOARD:</b><br>\nCreate clips and pin frequently used ones for easy access. This feature allows you to insert your most-used texts quickly, saving you time and effort.<br><br>\n<b>📳 CUSTOMIZABLE SETTINGS:</b><br>\nTailor your typing experience by toggling vibrations, popups on key presses, and selecting your preferred language from the list of supported ones. Personalize your keyboard settings to suit your preferences.<br><br>\n<b>🌙 MATERIAL DESIGN AND DARK THEME:</b><br>\nEnjoy a sleek, modern design with a default dark theme. Fossify Keyboard offers a visually appealing and comfortable user experience, making typing a pleasure.<br><br>\n<b>🔒 PRIVACY AND SECURITY:</b><br>\nYour privacy is our top priority. Fossify Keyboard does not collect or share any user information with third parties. Experience peace of mind knowing your typing activity remains private and secure.<br><br>\n<b>🎨 CUSTOMIZABLE COLORS:</b><br>\nPersonalize your keyboard with customizable colors. Fossify Keyboard allows you to choose and adjust colors to match your style and preferences.<br><br>\n<b>🌐 OPEN-SOURCE TRANSPARENCY:</b><br>\nFossify Keyboard is fully open-source, providing you with transparency and security. You have access to the source code for audits, ensuring a trustworthy and reliable typing tool.<br><br>\nExperience typing like never before – efficient, personalized, and secure. Download Fossify Keyboard now and elevate your typing experience.<br><br>\nExplore more Fossify apps: https://www.fossify.org<br>\nOpen-Source Code: https://www.github.com/FossifyOrg<br>\nJoin the community on Reddit: https://www.reddit.com/r/Fossify<br>\nConnect on Telegram: https://t.me/Fossify<br>\n","repo":{"author":"Fossify","repo":"https://github.com/FossifyOrg/Keyboard"},"version":"bbe15c72d2df6389e7240c630bbaf05e936262dfc57f64e2af677392fce6fa5b","site":null,"source":"https://github.com/FossifyOrg/Keyboard","license_or_tos":"GPL-3.0-only","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,102,111,115,115,105,102,121,46,107,101,121,98,111,97,114,100,47,101,110,45,85,83,47,105,99,111,110,95,69,89,110,75,88,101,54,115,53,79,102,122,82,84,73,76,107,56,50,53,113,110,110,50,78,119,112,49,117,110,51,122,51,53,118,66,113,65,120,109,98,108,89,61,46,112,110,103]},"verified":false}