{"appId":"org.wbftw.weil.sos_flashlight","appShortcutName":"SOS Flashlight: Advanced Morse Code Tool","appDisplayName":"SOS Flashlight: Advanced Morse Code Tool","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/org.wbftw.weil.sos_flashlight_10003.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Turn your phone into a Morse code device, to transmit emergency messages.\nSOS Flashlight App transforms your smartphone into a powerful Morse code signaling device, capable of transmitting emergency messages or custom text through multiple channels simultaneously.\n\n<b>Features</b>\n\n- <b>Signal Transmission Methods</b>\n    - <b>Flashlight</b>: Utilizes your device's camera led flashlight to transmit visual signals.\n    - <b>Vibration</b>: Sends tactile signals through device vibration.\n    - <b>Audio</b>: Generates clear audio tones at 700Hz frequency.\n    - <b>Screen Light</b>: Maximizes screen brightness to create visual signals in darkness.\n- <b>Core Capabilities</b>\n    - <b>Background Service</b>: Continue signaling even when the app is minimized or screen is locked.\n    - <b>Message Customization</b>: Send any custom message in Morse code.\n    - <b>Adjustable Speed</b>: Choose from slow, medium, fast, or custom transmission speeds.\n    - <b>Morse Code Decoder</b>: Convert received Morse code into readable text.\n    - <b>User Preferences</b>: Independently toggle each signaling method based on your needs.\n\n<b>Usage</b>\n\n- <b>Emergency SOS</b>: Press the SOS button to immediately begin transmitting the international SOS signal (... --- ...).\n- <b>Custom Message</b>: Enter your text in the input field and press \"Send\" to convert and transmit.\n- <b>Decoder</b>: Navigate to the decoder screen to translate incoming Morse code signals.\n- <b>Settings</b>: Customize transmission speed and toggle different signaling methods.\n\n<b>Contribute</b>\n\nContributions are welcome! Feel free to open issues or submit pull requests on our GitHub repo.\n\n<b>License</b>\n\nThis project is licensed under the GNU General Public License (GPLv3) - see the LICENSE file for details.\n\n<b>Source</b>\n\nhttps://github.com/WeilJimmer/SOSFlashlightApp.git","repo":{"author":"Weil Jimmer","repo":"https://github.com/WeilJimmer/SOSFlashlightApp"},"usrVersion":"acd2d233e12f2159714aa7b08a20086e37afdb7ed7de9de4ad38f90776bd84c4","version":1761421079,"site":null,"source":"https://github.com/WeilJimmer/SOSFlashlightApp","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}