{"appId":"org.avmedia.gshockGoogleSync","appShortcutName":"Casio G-Shock Smart Sync","appDisplayName":"Casio G-Shock Smart Sync","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Ivo Zivkov/https://github.com/izivkov/CasioGShockPhoneSync/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Add smart functions to your Casio square BT G-Shock (B5600, B5000, B2100)\nNote: We now support the B2100 series of G-Shock watches!\n\nI think we can do better than the official G-Shock Connected App! This app provides the following extra features:\n\n- Sets watch's reminders from Google Calendar\n- Automatically sets correct timezone when travelling. No need to switch between Word Time and Home time\n- Use your watch to trigger actions on your phone remotely, like taking pictures, dialling a phone number, etc.\n- Auto-configure most watch settings from phone's configuration.\n- Phone's alarms can be synced with watch's alarms.\n- Super fast connection time: 3.5 seconds vs 12 seconds for the official app.\n\nSupported Watches\n=================\nG(M)W-5600, G(M)W-5000, GA-B2100, GST-B500, MSG-B100, G-B001, GBD-800 (Partial support), MRG-B5000, GCW-B5000\n\nSetting Time\n============\nThe local time can be set from the main screen by pressing the Send to Watch \nbutton next to the current time display. The app uses your current location to \nget the local lime. You can then set the watch time accordingly, without having \nto change your World Time selection on the watch.\n\nThis screen also shows your Home Time location and battery level.\n\nAlarms\n======\nThe B5600/B5000/B2100 watches have 5 alarms and a Signal or chime setting. They are first read\nfrom the watch, and displayed in the app. The alarms can be updated by pressing \non the time display of each alarm. A dialog will appear which allows you to \nselect the time.\n\nOnce the alarms have been set, you can send them to the watch, or send them to \nthe Alarm Clock app on the phone. Unfortunately, there is currently no way to \nread the alarms from the AlarmClock app programmatically, so we cannot set the \nwatch alarms from this app. However, we can set the Alarm Clock app with the \nwatch's alarms.\n\nEvents\n======\nThis screen displays Events from your Google Calendar and allows you to send \nthese events to the watch's reminders.\n\nEvents could be one time, repeating daily, weekly, monthly or yearly, or some complex period\nsuch as every second Thursday of the month. Not all event types can be supported on the watch, but this app\nattempts to adopt the calendar events to the watch as much as possible. The \nonly not supported event types are daily and complex events, such as every\nsecond Thursday of the month. Events occurring number of times are simulated on the watch with\na start and end date, matching the event start time, count and frequency.\nIn case the calendar event cannot be adopted to a watch reminder, the app\nwill display the event as Incompatible. Only future events and recurring\nevents which have not expired are displayed.\n\nThe watch only supports all-day reminders. However, if the Google calendar \nevent has a specific time, it will still be used as a day reminder on the watch.\n\nActions\n=======\nThe selected actions are run when the user short-presses the lower-right watch \nbutton from disconnected mode (initial screen).\n\nUsing these actions, the watch acts like a remote control for your phone.\n\nWhere are my World Cities?\n==========================\nUsing an app to manually swap between Home Time and World Time is a bit silly.\nYour phone already knows where you are. When setting time, this app will also\nset the Home Time, Timezone and DST state to your current location.\nSo when travelling to another timezone, just set time and you are good to go.\n\nBuild Your Own App\n==================\nFor those who want to build their own Android app for interfacing with the G-Shock 5000/5600/B2100 watches,\nI have also created an API (library) project here: https://github.com/izivkov/GShockAPI.\n\n\n\n","repo":{"author":"Ivo Zivkov","repo":"https://github.com/izivkov/CasioGShockPhoneSync"},"version":"3922b96c6447a48cb82faa96ad0bbf024143d992ae3fdefde013790bacba76d6","site":null,"source":"https://github.com/izivkov/CasioGShockPhoneSync","license_or_tos":"MIT","resources":null,"verified":false}