{"appId":"f:org.eagsoftware.laundrynotes","appShortcutName":"LaundryNotes","appDisplayName":"LaundryNotes","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.eagsoftware.laundrynotes_2.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Store washing information and symbols for all fabrics, making laundry easier!\nLaundryNotes is an Android app that allows you to manage the washing instructions for all clothing and fabrics in your home. This application contains the main symbols found on clothing labels, along with their descriptions, to help you remember how to wash each garment effectively and precisely.\n\nHave you ever encountered a symbol on a care label that you didn't know what it meant? LaundryNotes allows you to store information for each garment, making it easy to remember how to wash your clothes.\n\nDid some symbols may fade away after washing an item? LaundryNotes is completely waterproof! The care instructions will remain on your smartphone.\n\nThe key features of LaundryNotes include the ability to add any clothing or fabric item to the app, entering washing instructions based on the symbols found on the label or packaging of your garment, the option to add a reference photo for identifying the item, the option to add custom notes for additional information, the option to organize items into categories, and the search function to find items by category or name.\n\nThe interface of the app has been designed to be simple and intuitive. To add a new item, simply click on the \"+\" button and fill out the form with the desired information. To view or modify an existing item, simply click on it in the list. To delete an item, press and hold the symbol to open the deletion menu.\n","repo":{"author":"Minardil","repo":"https://codeberg.org/minardil/laundrynotes"},"version":"45b06f106324976c3d9364df1d1e6ac70de47298d90515c9357325ba52deea12","site":null,"source":"https://codeberg.org/minardil/laundrynotes","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,101,97,103,115,111,102,116,119,97,114,101,46,108,97,117,110,100,114,121,110,111,116,101,115,47,101,110,45,85,83,47,105,99,111,110,95,68,109,103,85,52,98,72,111,88,112,57,106,79,97,76,98,111,105,67,50,56,71,87,117,82,81,104,116,67,69,111,57,50,76,119,105,103,67,79,101,83,104,69,61,46,112,110,103]},"verified":false}