{"appId":"f:org.openobservatory.ooniprobe","appShortcutName":"OONI Probe","appDisplayName":"OONI Probe","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.openobservatory.ooniprobe_164.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["X64"]}},"displayImages":[],"description":"Measure Internet Censorship, Speed & Performance\nAre websites and social media apps blocked? Is your network unusually slow? Run OONI Probe to find out!\n\nWith this app, you will examine the blocking of websites and instant messaging apps, measure your network's speed and performance, and check whether systems that could be responsible for censorship and surveillance are in your network.\n\nOONI Probe is developed by the Open Observatory of Network Interference (OONI), a free software project (under The Tor Project) that aims to uncover internet censorship around the world.\n\nSince 2012, OONI’s global community has collected millions of network measurements from more than 200 countries, shedding light on multiple cases of network interference.\n\nCollect evidence of internet censorship\nYou can check whether and how websites and instant messaging apps are blocked. The network measurement data you will collect may serve as evidence of internet censorship.\n\nDetect systems responsible for censorship and surveillance\nOONI Probe tests are also designed to uncover the presence of systems (middleboxes) that could be responsible for censorship and surveillance.\n\nMeasure the speed and performance of your network\nYou can measure the speed and performance of your network by running OONI's implementation of the Network Diagnostic Test (NDT). You can also measure video streaming performance with the Dynamic Adaptive Streaming over HTTP (DASH) test.\n\nOpen data\nOONI publishes network measurement data because open data allows third parties to verify OONI findings, conduct independent studies, and answer other research questions. Openly publishing OONI data also helps increase transparency of internet censorship around the world. You can explore and download OONI data here: https://ooni.io/data/\n\nFree software\nAll OONI Probe tests (including our NDT and DASH implementations), are based on free and open source software. You can find OONI software projects on GitHub: https://github.com/ooni. Curious to learn how OONI Probe tests work? Learn more: https://ooni.io/nettest/\n\nTo receive updates from the OONI-verse, follow us on Twitter: https://twitter.com/OpenObservatory\n","repo":{"author":"Open Observatory of Network Interference","repo":"https://github.com/ooni/probe-multiplatform"},"version":"6ed07d149b48ff05ea4ced7f5a8ea1eed3778c542ab8eec8fc1d3daa842e1d98","site":null,"source":"https://github.com/ooni/probe-multiplatform","license_or_tos":"BSD-2-Clause","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,111,112,101,110,111,98,115,101,114,118,97,116,111,114,121,46,111,111,110,105,112,114,111,98,101,47,101,110,45,85,83,47,105,99,111,110,95,113,72,119,71,76,81,77,80,70,102,54,111,99,118,115,98,82,45,48,112,105,115,53,50,72,49,101,56,102,80,107,65,66,110,55,118,56,118,68,53,122,78,103,61,46,112,110,103]},"verified":false}