{"appId":"f:org.secuso.privacyfriendlyactivitytracker","appShortcutName":"Pedometer (PFA)","appDisplayName":"Pedometer (PFA)","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.secuso.privacyfriendlyactivitytracker_16.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":17,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"(SECUSO) Counts your steps in the background. Customize daily goals.\nPrivacy Friendly Pedometer can count your steps in background, provides you an overview about your walked steps and allows you to define custom walking modes and notifications if the achievement of your daily step goal is in danger. The app requires minimal permissions (Run at startup and prevent phone from sleeping). It belongs to the Privacy Friendly Apps group developed by the research group SECUSO at Karlsruhe Intitute of Technology. More information can be found an secuso.org/pfa\n\nPrivacy Friendly Pedometer can count your daily walked steps while it runs in background. It gives you an overview about your walked steps, distance and about the calories you have burned while walking. You can add and choose different walking modes with different step lengths, such as walking or running, to improve the calculation of distance and calories.\n\nIn a special training mode you can track your training sessions. To each training session additional information, such as feeling or a description, can be added.\n\nWhat makes Privacy Friendly Pedometer different from other pedometers?\n\n1. Minimal amount of permissions:\n* Run at startup: This permission is required to restart the step counting when your phone boots.\n* prevent phone from sleeping: On some devices the processor falls asleep and prevents counting steps. With this permission the app can keep the processor awake while counting steps.\n\nMost of Pedometer Apps in the Google Play Store require additional permissions. E.g. accessing the network or Internet which is mostly used to display advertisement. Some apps have access to GPS or telephony data.\n\n2. No advertisement.\nMany other free apps in the Google Play Store dazzle annoying advertising and also shortens battery life.\n\nYou can reach us via\nTwitter - @SECUSOResearch https://twitter.com/secusoresearch\nMastodon - @SECUSO_Research@bawü.social https://xn--baw-joa.social/@SECUSO_Research/\nJob opening - https://secuso.aifb.kit.edu/english/Job_Offers_1557.php","repo":{"author":"SECUSO - Security Usability Society","repo":"https://github.com/SecUSo/privacy-friendly-pedometer"},"version":"05b07eba9e9aff1123a283905f21b6434554fe2d413e37292f326cc34c0a3475","site":null,"source":"https://github.com/SecUSo/privacy-friendly-pedometer","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,115,101,99,117,115,111,46,112,114,105,118,97,99,121,102,114,105,101,110,100,108,121,97,99,116,105,118,105,116,121,116,114,97,99,107,101,114,47,101,110,45,85,83,47,105,99,111,110,95,90,78,89,102,85,67,71,68,104,120,90,88,114,118,74,75,119,49,103,67,80,65,116,83,114,57,79,66,84,105,121,89,112,117,122,74,122,51,90,54,111,116,73,61,46,112,110,103]},"verified":false}