{"appId":"f:org.framasoft.peertube","appShortcutName":"PeerTube","appDisplayName":"PeerTube","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.framasoft.peertube_18.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Federated video platform\nDiscover the PeerTube mobile application, a free alternative to video streaming giants like YouTube. Thanks to its decentralised network, PeerTube lets you watch, share and publish videos in complete freedom, while remaining in control of your data.\n\nThe official PeerTube application is your gateway to hundreds of thousands of videos, available across more than a thousand different platforms, and now viewable on your mobile device wherever you are.\n\nMain features of the application\n\n🎬 Watch videos and subscribe to your favourite channels: Follow your favourite creators, no matter which instance they're hosted on, and find out what's new on the home screen. Find videos you've watched and saved for later in ‘Library’.\n\n🌐 Explore the PeerTube federation: easily browse videos and creators on different PeerTube instances hosted around the world. Discover diverse content from a multitude of interconnected servers. No account required!\n\n🔎Search and discover videos: Use our search engine to find specific videos, channels or themes across the entire PeerTube network. Choose themes that interest you to find the content that's right for you.\n\nAnd for future releases\n\n⬇️ Offline download: Download videos directly to your device and watch them without an internet connection, wherever and whenever you want.\n\n🔊 Upload videos from your mobile device: Easily import your own videos from your device, and contribute to PeerTube's decentralised ecosystem.\n\n🗨️ Comment and interact: Comment, discuss and exchange around videos with the PeerTube community.\n\nWhy choose PeerTube?\n\nPeerTube is more than just a video platform. It's a decentralised network that respects your privacy and offers you an ethical alternative to the platforms of surveillance capitalism. Unlike centralised services, PeerTube does not collect your personal data or track you for advertising purposes. With PeerTube, you have complete control over your video experience.\n\nDownload the PeerTube application now and join a community that supports a free, decentralised Internet that respects its users.\n\nWho is behind PeerTube?\n\nPeerTube is a project developed by Framasoft, a French non-profit organisation committed to popular education about the digital commons. Framasoft is known for its many initiatives aimed at raising public awareness of alternatives to large centralised platforms and encouraging digital practices that are more respectful of privacy and individual freedoms. This is done in particular through the De-google-ify Internet campaign, which proposes some fifteen services as alternatives to those of the net giants.\nYou can support Framasoft at https://soutenir.framasoft.org","repo":{"author":"Framasoft","repo":"https://framagit.org/framasoft/peertube/mobile-application"},"version":"5ba1fc6d42c29f4a7b32c39410464573739630523da3237d26e943c707088da8","site":null,"source":"https://framagit.org/framasoft/peertube/mobile-application","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,102,114,97,109,97,115,111,102,116,46,112,101,101,114,116,117,98,101,47,101,110,45,85,83,47,105,99,111,110,95,89,102,75,57,120,87,49,78,102,89,70,112,115,103,121,72,82,56,75,111,55,111,115,114,68,98,89,56,78,87,114,83,97,97,82,70,112,79,50,53,107,122,99,61,46,112,110,103]},"verified":false}