{"appId":"f:org.sufficientlysecure.keychain","appShortcutName":"OpenKeychain: Easy PGP","appDisplayName":"OpenKeychain: Easy PGP","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/org.sufficientlysecure.keychain_60400.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":15,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Encrypt your Files and Communications. Compatible with the OpenPGP Standard.\nOpenKeychain helps you communicate more privately and securely. It uses encryption to ensure that your messages can be read only by the people you send them to, others can send you messages that only you can read, and these messages can be digitally signed so the people getting them are sure who sent them. OpenKeychain is based on the well established OpenPGP standard making encryption compatible across your devices and systems. For a list of compatible software for Windows, Mac OS, and other operating systems consult http://openpgp.org/software/.\n\nModern encryption is based on digital “keys”. OpenKeychain stores and manages your keys, and those of the people you communicate with, on your Android smartphone. It also helps you find others’ keys online, and exchange keys. But its most frequent use is in using those keys to encrypt and decrypt messages.\n\n★ Integration with other Apps:\n• K-9 Mail\n• Conversations\n• and many more…\n\n★ Open Source: OpenKeychain is designed to be trustworthy. It’s Free Software with no secrets; anyone can examine and validate every bit of it (Source code available at https://github.com/open-keychain/open-keychain)\n\n★ Independent Security Audit: The auditing company Cure53 performed an intensive security audit of OpenKeychain. The security experts summarize their final result with \"[...] none of the spotted issues were considered to be of a critical severity in terms of security implications. The latter is a significant and impressive result for an app of this complexity and relevance.\"\n\n★ Permissions: Because OpenKeychain is Free Software, anyone can validate that the permissions are indeed only required for the listed features.\n• In-app purchases: Donate to the developers\n• Identity: Pre-fill name and email addresses\n• Contacts: Connect keys to your contacts (only offline)\n• Photos/Media/Files: Import/export keys from SD card\n• Camera: Scan QR Codes to add other people's keys\n• Others: Internet permission to retrieve keys, NFC permission to use YubiKeys\n\nStarting with Android 6, permissions are requested when required in-app!","repo":{"author":"Dominik Schürmann","repo":"https://github.com/open-keychain/open-keychain"},"version":"f88374b9113aa9ddba865258bd989eb3ac2ca1577d92e59d6e84228e080674ce","site":null,"source":"https://github.com/open-keychain/open-keychain","license_or_tos":"GPL-3.0-or-later","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,114,101,112,111,47,111,114,103,46,115,117,102,102,105,99,105,101,110,116,108,121,115,101,99,117,114,101,46,107,101,121,99,104,97,105,110,47,101,110,45,85,83,47,105,99,111,110,95,55,67,86,87,76,102,45,108,122,116,68,86,69,108,50,72,89,95,84,110,70,48,100,57,56,110,119,113,95,95,120,114,48,53,89,117,56,108,76,90,111,86,52,61,46,112,110,103]},"verified":false}