{"appId":"f:privacyfriendlyshoppinglist.secuso.org.privacyfriendlyshoppinglist","appShortcutName":"Shopping List (Privacy Friendly)","appDisplayName":"Shopping List (Privacy Friendly)","authorId":"f:fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://f-droid.org/repo/privacyfriendlyshoppinglist.secuso.org.privacyfriendlyshoppinglist_8.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":17,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"(SECUSO) Create shopping lists and manage them privacy friendly\nPrivacy Friendly Shopping List allows you to create shopping lists and manage them. It belongs to the Privacy Friendly Apps group developed by the research group SECUSO at Technische Universität Darmstadt. More information can be found an secuso.org/pfa\n\nCreate shopping lists and managing them (adding, editing and deleting of lists and items).\nFurther features include:\n– Prioritization of the list regarding importance of items.\n– Setup of deadlines and reminders. The reminder will appear as a notification.\n– Visualizing of shopping activities through a bar diagram.\n– Adding of categories, stores and additional notes to products. Possibility to add a product picture. This photo can only be accessed by Privacy Friendly Shopping List.\n– Sharing of lists and/or products as text without the requirement of special system permissions.\n\nWhat makes Privacy Friendly Shopping List different from other similar apps?\n\n1. Minimal Permissions\nPrivacy Friendly Shopping List does not use any permission for its core functions. Only the camera permission is needed, so you can take a picture for a particular product. If this permission is denied (Android version higher than 6), the feature will not be available. All other features will be at your disposition.\n\n2. Full control over your data\nAll saved data in the statistics can be deleted permanently with just a few clicks. All this data lives only inside Privacy Friendly Shopping List and can not be accessed from outside.\n\n3. Sharing of list or product data without access of the phone contacts.\n\n4. No advertisement\nPrivacy Friendly Shopping List completely relinquishes advertisement.\n","repo":{"author":"SECUSO","repo":"https://github.com/SecUSo/privacy-friendly-shopping-list"},"version":"34c4eb73ebb9648457404ab2c6e85b7e4775a81e2cedb684b9c5e4158e481c01","site":null,"source":"https://github.com/SecUSo/privacy-friendly-shopping-list","license_or_tos":"Apache-2.0","resources":{"0":[104,116,116,112,115,58,47,47,102,45,100,114,111,105,100,46,111,114,103,47,97,115,115,101,116,115,47,105,99,95,114,101,112,111,95,97,112,112,95,100,101,102,97,117,108,116,95,75,78,78,48,48,56,90,50,75,55,86,78,80,90,79,70,76,77,84,114,121,51,74,107,102,70,89,80,120,86,71,68,111,112,83,49,105,119,87,101,53,119,111,61,46,112,110,103]},"verified":false}