{"appId":"sh.hnet.comfychair","appShortcutName":"ComfyChair","appDisplayName":"ComfyChair","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/sh.hnet.comfychair_37.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":33,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Native Android client for ComfyUI - generate AI images and videos on mobile\nComfyChair brings the power of ComfyUI to your Android device with a native, Material Design 3 interface. Connect to your ComfyUI server and generate AI images and videos right from your phone.\n\nWhat you can do:\n- Generate images from text prompts with live progress updates\n- Transform existing images or use inpainting with a built-in mask editor\n- Create AI videos from text or animate still images\n- Manage your generation queue, cancel jobs, or prioritize requests\n- Browse and organize all your creations in a unified gallery\n- Work offline with cached data when your server is unavailable\n\nFlexible workflow support:\n- Works with both traditional Checkpoint and modern UNET workflows (Flux, Z-Image, and more)\n- Stack up to 5 LoRAs with individual strength controls\n- Create new workflows from scratch or import existing ones from ComfyUI\n- Full node graph visualization and editing with a searchable node browser\n- Organize nodes into groups and add notes with Markdown support\n\nBuilt for mobile:\n- Smooth, responsive interface built with Jetpack Compose\n- Manage multiple servers with per-server settings\n- HTTP Basic Auth and API key authentication for secured servers\n- Pinch-to-zoom media viewer with swipe navigation\n- Batch operations for saving, sharing, or deleting multiple items\n- Backup and restore your configuration across devices\n- Available in English, German, French, Polish, Spanish, and Chinese\n\nRequirements:\n- A running ComfyUI server (local or remote)\n- Android 13 or higher\n\nComfyChair is free, open source (GPL-3.0), and not affiliated with the official ComfyUI project.","repo":{"author":"Legal HKr","repo":"https://github.com/legal-hkr/comfychair"},"usrVersion":"44879760a4f06e7e7a5437079eb2812f3a5fc340e9862740fd4cf06b596aaba8","version":1768951310,"site":null,"source":"https://github.com/legal-hkr/comfychair","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}