{"appId":"top.yztz.msggo","appShortcutName":"MsgGo","appDisplayName":"MsgGo","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/top.yztz.msggo_26000301.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"一款功能强大的批量短信发送工具。\nMsgGo is a powerful bulk SMS tool designed for the efficient management and delivery of large-scale messaging. Built with modern Android design standards, it supports data import from Excel spreadsheets combined with templates for personalized message distribution, providing a clean, fast, and private user experience.\n\n<b>Core Features</b>\n\n- <b>Data Import</b>: Directly import SMS data from Excel (.xls/.xlsx) files.\n\n- <b>Dynamic Templates</b>: Support for custom SMS templates with variable replacement (e.g., \"%{#Name#}\") to achieve bulk personalized distribution.\n\n- <b>Smart Column Selection</b>: Flexible configuration of phone number columns to adapt to various contact list formats.\n\n- <b>Multi-SIM Support</b>: Robust SIM card detection and selection, allowing you to specify a specific slot for sending tasks.\n\n- <b>Progress Monitoring</b>: Dual-track progress monitoring system to view sending status in real-time.\n\n- <b>History Management</b>: Automatically saves sending records and template configurations, supporting one-click reloading of historical tasks.\n\n- <b>Fault-Tolerant Design</b>: Configurable sending delays to effectively avoid carrier risk control and improve delivery success rates.\n\n<b>Permissions</b>\n\n- <b>Send SMS (SEND_SMS)</b>: To implement the core SMS delivery functionality.\n\n- <b>Read Phone State (READ_PHONE_STATE)</b>: Used to identify multi-SIM slot information and signal status.\n\n<b>License</b>\n\nApache-2.0","repo":{"author":"Yztz","repo":"https://github.com/yztz/MsgGo"},"usrVersion":"ba34adabe0c5673980dcc14d9af8f73e8d7e076f79fa9f009b10ad54a032b7c3","version":1767767613,"site":null,"source":"https://github.com/yztz/MsgGo","license_or_tos":"Apache-2.0","resources":null,"verified":false}