{"appId":"uk.nktnet.webviewkiosk","appShortcutName":"Webview Kiosk","appDisplayName":"Webview Kiosk","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/uk.nktnet.webviewkiosk_105.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Turn your Android device into a locked-down web page in fullscreen mode.\nWebview Kiosk is a free and open-source Android application for secure, kiosk-style web browsing.\n\nIt can function as digital signage, a kid-friendly restricted browser, an immersive web reader, an interactive signup form, a home assistant dashboard, or simply a wall clock.\n\nDesigned for small businesses and device owners who are looking for a simple and standalone Kiosk solution.\n\n### Key Features\n\n#### Core / Standalone\n\n- <b>Lock Task Mode (Pin):</b> prevent access to your device's home screen, apps and status bar\n- <b>Secure Settings:</b> configurations are protected by biometrics, device credentials or custom password\n- <b>URL Filtering:</b> use regular expressions to control web access through a URL blacklist and whitelist\n- <b>Export/Import:</b> backup and restore user settings in Base64 or JSON format\n- <b>Local files:</b> display an image, audio, video, or HTML file in kiosk mode from your device\n- <b>Default Launcher:</b> functions as a home app that and can launch other apps\n\n#### Remote Management / Enterprise\n\n- <b>Message Queuing Telemetry Transport (MQTT)</b>\n  - Monitor events, update settings, execute commands and build custom automations using the API\n  - Requires an MQTT broker (e.g. Mosquitto, EMQX or HiveMQ)\n- <b>Managed Configurations (App Restrictions)</b>\n  - For fully-managed (company-owned) devices, settings can be remotely configured via an MDM/EMM provider\n  - Advanced users using a device policy controller (e.g. Test DPC or OwnDroid) can also enforce configurations locally\n\nFor more details, visit the official documentation:\n\n- https://webviewkiosk.nktnet.uk\n\n### Additional Permissions\n\nThe Android permissions below are <b>optional</b> and their corresponding features are <b>disabled in the app settings by default</b>:\n\n- CAMERA\n- RECORD_AUDIO\n- ACCESS_FINE_LOCATION\n- ACCESS_COARSE_LOCATION\n\nOnly enable them if they are needed by your website or web application. These permissions will not be used for any other purpose.\n\nIn addition, the <b>QUERY_ALL_PACKAGES</b> permission is used for:\n\n1. Launching other apps, which can be helpful if Webview Kiosk set as the default launcher\n2. Transferring device ownership to another admin receiver (e.g. OwnDroid or Dhizuku)\n\n### Contact\n\n#### Questions/Feature Requests\n\nCreate a `Q&A` for questions and `Ideas` for feature requests on GitHub discussions:\n\n- https://github.com/nktnet1/webview-kiosk/discussions\n\n#### Bugs/Issues\n\nReport bugs by creating a GitHub issue describing the problem and how it can be reproduced:\n\n- https://github.com/nktnet1/webview-kiosk/issues\n\nPlease also include your device model, app version and android version.\n\n#### Other\n\nFor all other enquiries, please reach out to:\n\n```\nsupport@webviewkiosk.nktnet.uk\n```\n","repo":{"author":"Khiet Tam Nguyen","repo":"https://github.com/nktnet1/webview-kiosk"},"usrVersion":"bf845d98b482b708a440d7c4b3ef277776b079586dd86dcdc3dd83da3c16ec27","version":1766180395,"site":null,"source":"https://github.com/nktnet1/webview-kiosk","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}