{"appId":"uk.nktnet.webviewkiosk","appShortcutName":"Webview Kiosk","appDisplayName":"Webview Kiosk","authorId":"1","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"url","url":"https://f-droid.org/repo/uk.nktnet.webviewkiosk_106.apk"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Turn your Android device into a locked-down web page in fullscreen mode.\nWebview Kiosk is a free and open-source Android application for secure, kiosk-style web browsing.\n\nIt can function as digital signage, a kid-friendly restricted browser, an immersive web reader, an interactive signup form, a home assistant dashboard, or simply a wall clock.\n\nDesigned for small businesses and device owners who are looking for a simple and standalone Kiosk solution.\n\n### Key Features\n\n#### Core / Standalone\n\n- <b>Lock Task Mode (Pin):</b> prevent access to your device's home screen, apps and status bar\n- <b>Secure Settings:</b> configurations are protected by biometrics, device credentials or custom password\n- <b>URL Filtering:</b> use regular expressions to control web access through a URL blacklist and whitelist\n- <b>Export/Import:</b> backup and restore user settings in Base64 or JSON format\n- <b>Local files:</b> display an image, audio, video, or HTML file in kiosk mode from your device\n- <b>Default Launcher:</b> functions as a home app that and can launch other apps\n\n#### Remote Management / Enterprise\n\n- <b>Message Queuing Telemetry Transport (MQTT)</b>\n  - Monitor events, update settings, execute commands and build custom automations using the API\n  - Requires an MQTT broker (e.g. Mosquitto, EMQX or HiveMQ)\n- <b>Managed Configurations (App Restrictions)</b>\n  - For fully-managed (company-owned) devices, settings can be remotely configured via an MDM/EMM provider\n  - Advanced users using a device policy controller (e.g. Test DPC or OwnDroid) can also enforce configurations locally\n\nFor more details, visit the official documentation:\n\n- https://webviewkiosk.nktnet.uk\n\n### Permissions\n\n- <b>INTERNET</b>: for general web browsing\n- <b>CAMERA</b>: (optional) for use with web apps that requires photo/video capture\n- <b>RECORD_AUDIO</b>: (optional) for use with web apps that requires audio capture\n- <b>MODIFY_AUDIO_SETTINGS</b>: for routing audio (microphone will not work without this)\n- <b>ACCESS_FINE_LOCATION</b>: (optional) for web apps that needs precise geolocation\n- <b>ACCESS_COARSE_LOCATION</b>: (optional) for web apps that needs approximate geolocation\n- <b>QUERY_ALL_PACKAGES</b>: to find launchable apps, device owners and lock task packages\n- <b>POST_NOTIFICATIONS</b>: (optional) for lock task mode (kiosk) launches and MQTT\n- <b>FOREGROUND_SERVICE</b>: for persistent notification and management with lock task and MQTT\n- <b>FOREGROUND_SERVICE_SPECIAL_USE</b>: provides a return mechanism for opening apps in kiosk\n- <b>USE_BIOMETRIC</b>: replaces USE_FINGERPRINT from Android 9 onwards\n- <b>USE_FINGERPRINT</b>: use fingerprint hardware when accessing settings or unlocking kiosk\n- <b>API (Dhizuku)</b>: to request shared device owner privileges\n\n### Contact\n\n#### Questions/Feature Requests\n\nCreate a `Q&A` for questions and `Ideas` for feature requests on GitHub discussions:\n\n- https://github.com/nktnet1/webview-kiosk/discussions\n\n#### Bugs/Issues\n\nReport bugs by creating a GitHub issue describing the problem and how it can be reproduced:\n\n- https://github.com/nktnet1/webview-kiosk/issues\n\nPlease also include your device model, app version and android version.\n\n#### Other\n\nFor all other enquiries, please reach out to:\n\n```\nsupport@webviewkiosk.nktnet.uk\n```\n","repo":{"author":"Khiet Tam Nguyen","repo":"https://github.com/nktnet1/webview-kiosk"},"usrVersion":"0e1cc03c40d05f8f672f94b99b7cbf598ca8ffbfb0dc4ff071d0efd00acdf1be","version":1766414737,"site":null,"source":"https://github.com/nktnet1/webview-kiosk","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}